Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x4ff (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 17 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x7931): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0xa4e4): ../Core/Src/custom_memory_manager.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x96c7): /home/vinh/STM32CubeIDE/workspace_microros/microros/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 4 (DW_TAG_typedef)
    <2b>   DW_AT_name        : (indirect string, offset: 0xd2f): size_t
    <2f>   DW_AT_decl_file   : 3
    <30>   DW_AT_decl_line   : 214
    <31>   DW_AT_decl_column : 23
    <32>   DW_AT_type        : <0x3b>
 <1><36>: Abbrev Number: 18 (DW_TAG_const_type)
    <37>   DW_AT_type        : <0x2a>
 <1><3b>: Abbrev Number: 2 (DW_TAG_base_type)
    <3c>   DW_AT_byte_size   : 4
    <3d>   DW_AT_encoding    : 7	(unsigned)
    <3e>   DW_AT_name        : (indirect string, offset: 0x2ad6): unsigned int
 <1><42>: Abbrev Number: 19 (DW_TAG_base_type)
    <43>   DW_AT_byte_size   : 4
    <44>   DW_AT_encoding    : 5	(signed)
    <45>   DW_AT_name        : int
 <1><49>: Abbrev Number: 2 (DW_TAG_base_type)
    <4a>   DW_AT_byte_size   : 8
    <4b>   DW_AT_encoding    : 5	(signed)
    <4c>   DW_AT_name        : (indirect string, offset: 0x61c5): long long int
 <1><50>: Abbrev Number: 2 (DW_TAG_base_type)
    <51>   DW_AT_byte_size   : 8
    <52>   DW_AT_encoding    : 4	(float)
    <53>   DW_AT_name        : (indirect string, offset: 0x37b): long double
 <1><57>: Abbrev Number: 2 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 1
    <59>   DW_AT_encoding    : 6	(signed char)
    <5a>   DW_AT_name        : (indirect string, offset: 0x8a5): signed char
 <1><5e>: Abbrev Number: 4 (DW_TAG_typedef)
    <5f>   DW_AT_name        : (indirect string, offset: 0x163a): __uint8_t
    <63>   DW_AT_decl_file   : 4
    <64>   DW_AT_decl_line   : 43
    <65>   DW_AT_decl_column : 24
    <66>   DW_AT_type        : <0x6a>
 <1><6a>: Abbrev Number: 2 (DW_TAG_base_type)
    <6b>   DW_AT_byte_size   : 1
    <6c>   DW_AT_encoding    : 8	(unsigned char)
    <6d>   DW_AT_name        : (indirect string, offset: 0x3e56): unsigned char
 <1><71>: Abbrev Number: 2 (DW_TAG_base_type)
    <72>   DW_AT_byte_size   : 2
    <73>   DW_AT_encoding    : 5	(signed)
    <74>   DW_AT_name        : (indirect string, offset: 0xb38): short int
 <1><78>: Abbrev Number: 2 (DW_TAG_base_type)
    <79>   DW_AT_byte_size   : 2
    <7a>   DW_AT_encoding    : 7	(unsigned)
    <7b>   DW_AT_name        : (indirect string, offset: 0x80bd): short unsigned int
 <1><7f>: Abbrev Number: 2 (DW_TAG_base_type)
    <80>   DW_AT_byte_size   : 4
    <81>   DW_AT_encoding    : 5	(signed)
    <82>   DW_AT_name        : (indirect string, offset: 0x857a): long int
 <1><86>: Abbrev Number: 4 (DW_TAG_typedef)
    <87>   DW_AT_name        : (indirect string, offset: 0x4fb4): __uint32_t
    <8b>   DW_AT_decl_file   : 4
    <8c>   DW_AT_decl_line   : 79
    <8d>   DW_AT_decl_column : 25
    <8e>   DW_AT_type        : <0x92>
 <1><92>: Abbrev Number: 2 (DW_TAG_base_type)
    <93>   DW_AT_byte_size   : 4
    <94>   DW_AT_encoding    : 7	(unsigned)
    <95>   DW_AT_name        : (indirect string, offset: 0x224c): long unsigned int
 <1><99>: Abbrev Number: 2 (DW_TAG_base_type)
    <9a>   DW_AT_byte_size   : 8
    <9b>   DW_AT_encoding    : 7	(unsigned)
    <9c>   DW_AT_name        : (indirect string, offset: 0x26ab): long long unsigned int
 <1><a0>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <a1>   DW_AT_byte_size   : 4
 <1><a2>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <a3>   DW_AT_byte_size   : 4
    <a3>   DW_AT_type        : <0xa7>
 <1><a7>: Abbrev Number: 2 (DW_TAG_base_type)
    <a8>   DW_AT_byte_size   : 1
    <a9>   DW_AT_encoding    : 8	(unsigned char)
    <aa>   DW_AT_name        : (indirect string, offset: 0x6825): char
 <1><ae>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <af>   DW_AT_byte_size   : 4
    <af>   DW_AT_type        : <0xb3>
 <1><b3>: Abbrev Number: 21 (DW_TAG_const_type)
 <1><b4>: Abbrev Number: 4 (DW_TAG_typedef)
    <b5>   DW_AT_name        : (indirect string, offset: 0x163c): uint8_t
    <b9>   DW_AT_decl_file   : 5
    <ba>   DW_AT_decl_line   : 24
    <bb>   DW_AT_decl_column : 19
    <bc>   DW_AT_type        : <0x5e>
 <1><c0>: Abbrev Number: 4 (DW_TAG_typedef)
    <c1>   DW_AT_name        : (indirect string, offset: 0xa0ab): uint32_t
    <c5>   DW_AT_decl_file   : 5
    <c6>   DW_AT_decl_line   : 48
    <c7>   DW_AT_decl_column : 20
    <c8>   DW_AT_type        : <0x86>
 <1><cc>: Abbrev Number: 4 (DW_TAG_typedef)
    <cd>   DW_AT_name        : (indirect string, offset: 0xe1c5e): BaseType_t
    <d1>   DW_AT_decl_file   : 2
    <d2>   DW_AT_decl_line   : 56
    <d3>   DW_AT_decl_column : 14
    <d4>   DW_AT_type        : <0x7f>
 <1><d8>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d9>   DW_AT_byte_size   : 4
    <d9>   DW_AT_type        : <0xb4>
 <1><dd>: Abbrev Number: 22 (DW_TAG_array_type)
    <de>   DW_AT_type        : <0xb4>
    <e2>   DW_AT_sibling     : <0xee>
 <2><e6>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <e7>   DW_AT_type        : <0x3b>
    <eb>   DW_AT_upper_bound : 15359
 <2><ed>: Abbrev Number: 0
 <1><ee>: Abbrev Number: 1 (DW_TAG_variable)
    <ef>   DW_AT_name        : (indirect string, offset: 0x385f): ucHeap
    <f3>   DW_AT_decl_file   : 1
    <f3>   DW_AT_decl_line   : 30
    <f4>   DW_AT_decl_column : 16
    <f5>   DW_AT_type        : <0xdd>
    <f9>   DW_AT_location    : 5 byte block: 3 7c 3 0 20 	(DW_OP_addr: 2000037c)
 <1><ff>: Abbrev Number: 24 (DW_TAG_structure_type)
    <100>   DW_AT_name        : (indirect string, offset: 0xa34d): A_BLOCK_LINK
    <104>   DW_AT_byte_size   : 8
    <105>   DW_AT_decl_file   : 1
    <106>   DW_AT_decl_line   : 34
    <107>   DW_AT_decl_column : 16
    <108>   DW_AT_sibling     : <0x125>
 <2><10c>: Abbrev Number: 12 (DW_TAG_member)
    <10d>   DW_AT_name        : (indirect string, offset: 0x7ecf): pxNextFreeBlock
    <111>   DW_AT_decl_file   : 1
    <111>   DW_AT_decl_line   : 36
    <112>   DW_AT_decl_column : 23
    <113>   DW_AT_type        : <0x125>
    <117>   DW_AT_data_member_location: 0
 <2><118>: Abbrev Number: 12 (DW_TAG_member)
    <119>   DW_AT_name        : (indirect string, offset: 0xab40): xBlockSize
    <11d>   DW_AT_decl_file   : 1
    <11d>   DW_AT_decl_line   : 37
    <11e>   DW_AT_decl_column : 9
    <11f>   DW_AT_type        : <0x2a>
    <123>   DW_AT_data_member_location: 4
 <2><124>: Abbrev Number: 0
 <1><125>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <126>   DW_AT_byte_size   : 4
    <126>   DW_AT_type        : <0xff>
 <1><12a>: Abbrev Number: 4 (DW_TAG_typedef)
    <12b>   DW_AT_name        : (indirect string, offset: 0x3587): BlockLink_t
    <12f>   DW_AT_decl_file   : 1
    <130>   DW_AT_decl_line   : 38
    <131>   DW_AT_decl_column : 3
    <132>   DW_AT_type        : <0xff>
 <1><136>: Abbrev Number: 1 (DW_TAG_variable)
    <137>   DW_AT_name        : (indirect string, offset: 0x7f19): xHeapStructSize
    <13b>   DW_AT_decl_file   : 1
    <13b>   DW_AT_decl_line   : 60
    <13c>   DW_AT_decl_column : 21
    <13d>   DW_AT_type        : <0x36>
    <141>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><147>: Abbrev Number: 1 (DW_TAG_variable)
    <148>   DW_AT_name        : (indirect string, offset: 0xa832): xStart
    <14c>   DW_AT_decl_file   : 1
    <14c>   DW_AT_decl_line   : 63
    <14d>   DW_AT_decl_column : 20
    <14e>   DW_AT_type        : <0x12a>
    <152>   DW_AT_location    : 5 byte block: 3 7c 3f 0 20 	(DW_OP_addr: 20003f7c)
 <1><158>: Abbrev Number: 1 (DW_TAG_variable)
    <159>   DW_AT_name        : (indirect string, offset: 0x4b79): pxEnd
    <15d>   DW_AT_decl_file   : 1
    <15d>   DW_AT_decl_line   : 63
    <15e>   DW_AT_decl_column : 29
    <15f>   DW_AT_type        : <0x169>
    <163>   DW_AT_location    : 5 byte block: 3 84 3f 0 20 	(DW_OP_addr: 20003f84)
 <1><169>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <16a>   DW_AT_byte_size   : 4
    <16a>   DW_AT_type        : <0x12a>
 <1><16e>: Abbrev Number: 1 (DW_TAG_variable)
    <16f>   DW_AT_name        : (indirect string, offset: 0x6d8c): xFreeBytesRemaining
    <173>   DW_AT_decl_file   : 1
    <173>   DW_AT_decl_line   : 67
    <174>   DW_AT_decl_column : 15
    <175>   DW_AT_type        : <0x2a>
    <179>   DW_AT_location    : 5 byte block: 3 88 3f 0 20 	(DW_OP_addr: 20003f88)
 <1><17f>: Abbrev Number: 1 (DW_TAG_variable)
    <180>   DW_AT_name        : (indirect string, offset: 0x5ae): xMinimumEverFreeBytesRemaining
    <184>   DW_AT_decl_file   : 1
    <184>   DW_AT_decl_line   : 68
    <185>   DW_AT_decl_column : 15
    <186>   DW_AT_type        : <0x2a>
    <18a>   DW_AT_location    : 5 byte block: 3 8c 3f 0 20 	(DW_OP_addr: 20003f8c)
 <1><190>: Abbrev Number: 1 (DW_TAG_variable)
    <191>   DW_AT_name        : (indirect string, offset: 0x63a): xBlockAllocatedBit
    <195>   DW_AT_decl_file   : 1
    <195>   DW_AT_decl_line   : 74
    <196>   DW_AT_decl_column : 15
    <197>   DW_AT_type        : <0x2a>
    <19b>   DW_AT_location    : 5 byte block: 3 90 3f 0 20 	(DW_OP_addr: 20003f90)
 <1><1a1>: Abbrev Number: 25 (DW_TAG_subprogram)
    <1a2>   DW_AT_external    : 1
    <1a2>   DW_AT_name        : (indirect string, offset: 0xe1267): memcpy
    <1a6>   DW_AT_decl_file   : 6
    <1a7>   DW_AT_decl_line   : 31
    <1a8>   DW_AT_decl_column : 9
    <1a9>   DW_AT_prototyped  : 1
    <1a9>   DW_AT_type        : <0xa0>
    <1ad>   DW_AT_declaration : 1
    <1ad>   DW_AT_sibling     : <0x1c1>
 <2><1b1>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <1b2>   DW_AT_type        : <0xa0>
 <2><1b6>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <1b7>   DW_AT_type        : <0xae>
 <2><1bb>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <1bc>   DW_AT_type        : <0x2a>
 <2><1c0>: Abbrev Number: 0
 <1><1c1>: Abbrev Number: 26 (DW_TAG_subprogram)
    <1c2>   DW_AT_external    : 1
    <1c2>   DW_AT_name        : (indirect string, offset: 0x6f5c): xTaskResumeAll
    <1c6>   DW_AT_decl_file   : 7
    <1c7>   DW_AT_decl_line   : 1341
    <1c9>   DW_AT_decl_column : 12
    <1ca>   DW_AT_prototyped  : 1
    <1ca>   DW_AT_type        : <0xcc>
    <1ce>   DW_AT_declaration : 1
 <1><1ce>: Abbrev Number: 27 (DW_TAG_subprogram)
    <1cf>   DW_AT_external    : 1
    <1cf>   DW_AT_name        : (indirect string, offset: 0x4b8b): vTaskSuspendAll
    <1d3>   DW_AT_decl_file   : 7
    <1d4>   DW_AT_decl_line   : 1287
    <1d6>   DW_AT_decl_column : 6
    <1d7>   DW_AT_prototyped  : 1
    <1d7>   DW_AT_declaration : 1
 <1><1d7>: Abbrev Number: 13 (DW_TAG_subprogram)
    <1d8>   DW_AT_name        : (indirect string, offset: 0xa1b0): prvInsertBlockIntoFreeList
    <1dc>   DW_AT_decl_file   : 1
    <1dc>   DW_AT_decl_line   : 397
    <1de>   DW_AT_decl_column : 13
    <1de>   DW_AT_prototyped  : 1
    <1de>   DW_AT_low_pc      : 0x8000af8
    <1e2>   DW_AT_high_pc     : 0xb4
    <1e6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1e8>   DW_AT_call_all_calls: 1
    <1e8>   DW_AT_sibling     : <0x21a>
 <2><1ec>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1ed>   DW_AT_name        : (indirect string, offset: 0x66e3): pxBlockToInsert
    <1f1>   DW_AT_decl_file   : 1
    <1f1>   DW_AT_decl_line   : 397
    <1f3>   DW_AT_decl_column : 54
    <1f4>   DW_AT_type        : <0x169>
    <1f8>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><1fb>: Abbrev Number: 3 (DW_TAG_variable)
    <1fc>   DW_AT_name        : (indirect string, offset: 0x50c9): pxIterator
    <200>   DW_AT_decl_file   : 1
    <200>   DW_AT_decl_line   : 399
    <202>   DW_AT_decl_column : 14
    <203>   DW_AT_type        : <0x169>
    <207>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><20a>: Abbrev Number: 9 (DW_TAG_variable)
    <20b>   DW_AT_name        : puc
    <20f>   DW_AT_decl_file   : 1
    <20f>   DW_AT_decl_line   : 400
    <211>   DW_AT_decl_column : 10
    <212>   DW_AT_type        : <0xd8>
    <216>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><219>: Abbrev Number: 0
 <1><21a>: Abbrev Number: 13 (DW_TAG_subprogram)
    <21b>   DW_AT_name        : (indirect string, offset: 0x6f6b): prvHeapInit
    <21f>   DW_AT_decl_file   : 1
    <21f>   DW_AT_decl_line   : 349
    <221>   DW_AT_decl_column : 13
    <221>   DW_AT_prototyped  : 1
    <221>   DW_AT_low_pc      : 0x8000a34
    <225>   DW_AT_high_pc     : 0xc4
    <229>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <22b>   DW_AT_call_all_calls: 1
    <22b>   DW_AT_sibling     : <0x26c>
 <2><22f>: Abbrev Number: 3 (DW_TAG_variable)
    <230>   DW_AT_name        : (indirect string, offset: 0x29a5): pxFirstFreeBlock
    <234>   DW_AT_decl_file   : 1
    <234>   DW_AT_decl_line   : 351
    <236>   DW_AT_decl_column : 14
    <237>   DW_AT_type        : <0x169>
    <23b>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><23e>: Abbrev Number: 3 (DW_TAG_variable)
    <23f>   DW_AT_name        : (indirect string, offset: 0x2d21): pucAlignedHeap
    <243>   DW_AT_decl_file   : 1
    <243>   DW_AT_decl_line   : 352
    <245>   DW_AT_decl_column : 10
    <246>   DW_AT_type        : <0xd8>
    <24a>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><24d>: Abbrev Number: 3 (DW_TAG_variable)
    <24e>   DW_AT_name        : (indirect string, offset: 0x9a91): uxAddress
    <252>   DW_AT_decl_file   : 1
    <252>   DW_AT_decl_line   : 353
    <254>   DW_AT_decl_column : 8
    <255>   DW_AT_type        : <0x2a>
    <259>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><25c>: Abbrev Number: 3 (DW_TAG_variable)
    <25d>   DW_AT_name        : (indirect string, offset: 0x932e): xTotalHeapSize
    <261>   DW_AT_decl_file   : 1
    <261>   DW_AT_decl_line   : 354
    <263>   DW_AT_decl_column : 8
    <264>   DW_AT_type        : <0x2a>
    <268>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><26b>: Abbrev Number: 0
 <1><26c>: Abbrev Number: 28 (DW_TAG_subprogram)
    <26d>   DW_AT_external    : 1
    <26d>   DW_AT_name        : (indirect string, offset: 0x104c): vPortInitialiseBlocksMicroROS
    <271>   DW_AT_decl_file   : 1
    <272>   DW_AT_decl_line   : 343
    <274>   DW_AT_decl_column : 6
    <275>   DW_AT_prototyped  : 1
    <275>   DW_AT_low_pc      : 0
    <279>   DW_AT_high_pc     : 0xe
    <27d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <27f>   DW_AT_call_all_calls: 1
 <1><27f>: Abbrev Number: 14 (DW_TAG_subprogram)
    <280>   DW_AT_external    : 1
    <280>   DW_AT_name        : (indirect string, offset: 0x8d05): xPortGetMinimumEverFreeHeapSizeMicroROS
    <284>   DW_AT_decl_file   : 1
    <284>   DW_AT_decl_line   : 337
    <286>   DW_AT_decl_column : 8
    <286>   DW_AT_prototyped  : 1
    <286>   DW_AT_type        : <0x2a>
    <28a>   DW_AT_low_pc      : 0
    <28e>   DW_AT_high_pc     : 0x18
    <292>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <294>   DW_AT_call_all_calls: 1
 <1><294>: Abbrev Number: 14 (DW_TAG_subprogram)
    <295>   DW_AT_external    : 1
    <295>   DW_AT_name        : (indirect string, offset: 0x707a): xPortGetFreeHeapSizeMicroROS
    <299>   DW_AT_decl_file   : 1
    <299>   DW_AT_decl_line   : 331
    <29b>   DW_AT_decl_column : 8
    <29b>   DW_AT_prototyped  : 1
    <29b>   DW_AT_type        : <0x2a>
    <29f>   DW_AT_low_pc      : 0
    <2a3>   DW_AT_high_pc     : 0x18
    <2a7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <2a9>   DW_AT_call_all_calls: 1
 <1><2a9>: Abbrev Number: 15 (DW_TAG_subprogram)
    <2aa>   DW_AT_external    : 1
    <2aa>   DW_AT_name        : (indirect string, offset: 0x21bf): pvPortCallocMicroROS
    <2ae>   DW_AT_decl_file   : 1
    <2ae>   DW_AT_decl_line   : 315
    <2b0>   DW_AT_decl_column : 7
    <2b0>   DW_AT_prototyped  : 1
    <2b0>   DW_AT_type        : <0xa0>
    <2b4>   DW_AT_low_pc      : 0x80009ea
    <2b8>   DW_AT_high_pc     : 0x48
    <2bc>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <2be>   DW_AT_call_all_tail_calls: 1
    <2be>   DW_AT_sibling     : <0x30e>
 <2><2c2>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <2c3>   DW_AT_name        : num
    <2c7>   DW_AT_decl_file   : 1
    <2c7>   DW_AT_decl_line   : 315
    <2c9>   DW_AT_decl_column : 36
    <2ca>   DW_AT_type        : <0x2a>
    <2ce>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><2d1>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <2d2>   DW_AT_name        : (indirect string, offset: 0x4b7f): xWantedSize
    <2d6>   DW_AT_decl_file   : 1
    <2d6>   DW_AT_decl_line   : 315
    <2d8>   DW_AT_decl_column : 48
    <2d9>   DW_AT_type        : <0x2a>
    <2dd>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><2e0>: Abbrev Number: 3 (DW_TAG_variable)
    <2e1>   DW_AT_name        : (indirect string, offset: 0xe35fe): count
    <2e5>   DW_AT_decl_file   : 1
    <2e5>   DW_AT_decl_line   : 318
    <2e7>   DW_AT_decl_column : 9
    <2e8>   DW_AT_type        : <0x2a>
    <2ec>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><2ef>: Abbrev Number: 9 (DW_TAG_variable)
    <2f0>   DW_AT_name        : mem
    <2f4>   DW_AT_decl_file   : 1
    <2f4>   DW_AT_decl_line   : 320
    <2f6>   DW_AT_decl_column : 9
    <2f7>   DW_AT_type        : <0xa0>
    <2fb>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><2fe>: Abbrev Number: 3 (DW_TAG_variable)
    <2ff>   DW_AT_name        : (indirect string, offset: 0xaf60): in_dest
    <303>   DW_AT_decl_file   : 1
    <303>   DW_AT_decl_line   : 321
    <305>   DW_AT_decl_column : 10
    <306>   DW_AT_type        : <0xa2>
    <30a>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><30d>: Abbrev Number: 0
 <1><30e>: Abbrev Number: 15 (DW_TAG_subprogram)
    <30f>   DW_AT_external    : 1
    <30f>   DW_AT_name        : (indirect string, offset: 0x4561): pvPortReallocMicroROS
    <313>   DW_AT_decl_file   : 1
    <313>   DW_AT_decl_line   : 292
    <315>   DW_AT_decl_column : 7
    <315>   DW_AT_prototyped  : 1
    <315>   DW_AT_type        : <0xa0>
    <319>   DW_AT_low_pc      : 0x8000990
    <31d>   DW_AT_high_pc     : 0x5a
    <321>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <323>   DW_AT_call_all_tail_calls: 1
    <323>   DW_AT_sibling     : <0x36d>
 <2><327>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <328>   DW_AT_name        : pv
    <32b>   DW_AT_decl_file   : 1
    <32b>   DW_AT_decl_line   : 292
    <32d>   DW_AT_decl_column : 36
    <32e>   DW_AT_type        : <0xa0>
    <332>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><335>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <336>   DW_AT_name        : (indirect string, offset: 0x4b7f): xWantedSize
    <33a>   DW_AT_decl_file   : 1
    <33a>   DW_AT_decl_line   : 292
    <33c>   DW_AT_decl_column : 47
    <33d>   DW_AT_type        : <0x2a>
    <341>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><344>: Abbrev Number: 3 (DW_TAG_variable)
    <345>   DW_AT_name        : (indirect string, offset: 0x612a): newmem
    <349>   DW_AT_decl_file   : 1
    <349>   DW_AT_decl_line   : 296
    <34b>   DW_AT_decl_column : 9
    <34c>   DW_AT_type        : <0xa0>
    <350>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><353>: Abbrev Number: 29 (DW_TAG_lexical_block)
    <354>   DW_AT_low_pc      : 0x80009b2
    <358>   DW_AT_high_pc     : 0x2a
 <3><35c>: Abbrev Number: 3 (DW_TAG_variable)
    <35d>   DW_AT_name        : (indirect string, offset: 0xe35fe): count
    <361>   DW_AT_decl_file   : 1
    <361>   DW_AT_decl_line   : 299
    <363>   DW_AT_decl_column : 10
    <364>   DW_AT_type        : <0x2a>
    <368>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><36b>: Abbrev Number: 0
 <2><36c>: Abbrev Number: 0
 <1><36d>: Abbrev Number: 30 (DW_TAG_subprogram)
    <36e>   DW_AT_external    : 1
    <36e>   DW_AT_name        : (indirect string, offset: 0xab2b): getBlockSize
    <372>   DW_AT_decl_file   : 1
    <373>   DW_AT_decl_line   : 277
    <375>   DW_AT_decl_column : 8
    <376>   DW_AT_prototyped  : 1
    <376>   DW_AT_type        : <0x2a>
    <37a>   DW_AT_low_pc      : 0x8000954
    <37e>   DW_AT_high_pc     : 0x3c
    <382>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <384>   DW_AT_call_all_calls: 1
    <384>   DW_AT_sibling     : <0x3c4>
 <2><388>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <389>   DW_AT_name        : pv
    <38c>   DW_AT_decl_file   : 1
    <38c>   DW_AT_decl_line   : 277
    <38e>   DW_AT_decl_column : 28
    <38f>   DW_AT_type        : <0xa0>
    <393>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><396>: Abbrev Number: 9 (DW_TAG_variable)
    <397>   DW_AT_name        : puc
    <39b>   DW_AT_decl_file   : 1
    <39b>   DW_AT_decl_line   : 280
    <39d>   DW_AT_decl_column : 11
    <39e>   DW_AT_type        : <0xd8>
    <3a2>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><3a5>: Abbrev Number: 3 (DW_TAG_variable)
    <3a6>   DW_AT_name        : (indirect string, offset: 0x6985): pxLink
    <3aa>   DW_AT_decl_file   : 1
    <3aa>   DW_AT_decl_line   : 281
    <3ac>   DW_AT_decl_column : 15
    <3ad>   DW_AT_type        : <0x169>
    <3b1>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><3b4>: Abbrev Number: 3 (DW_TAG_variable)
    <3b5>   DW_AT_name        : (indirect string, offset: 0xe35fe): count
    <3b9>   DW_AT_decl_file   : 1
    <3b9>   DW_AT_decl_line   : 286
    <3bb>   DW_AT_decl_column : 9
    <3bc>   DW_AT_type        : <0x2a>
    <3c0>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><3c3>: Abbrev Number: 0
 <1><3c4>: Abbrev Number: 31 (DW_TAG_subprogram)
    <3c5>   DW_AT_external    : 1
    <3c5>   DW_AT_name        : (indirect string, offset: 0x116d): vPortFreeMicroROS
    <3c9>   DW_AT_decl_file   : 1
    <3ca>   DW_AT_decl_line   : 228
    <3cb>   DW_AT_decl_column : 6
    <3cc>   DW_AT_prototyped  : 1
    <3cc>   DW_AT_low_pc      : 0x800089c
    <3d0>   DW_AT_high_pc     : 0xb8
    <3d4>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <3d6>   DW_AT_call_all_tail_calls: 1
    <3d6>   DW_AT_sibling     : <0x43a>
 <2><3da>: Abbrev Number: 32 (DW_TAG_formal_parameter)
    <3db>   DW_AT_name        : pv
    <3de>   DW_AT_decl_file   : 1
    <3df>   DW_AT_decl_line   : 228
    <3e0>   DW_AT_decl_column : 31
    <3e1>   DW_AT_type        : <0xa0>
    <3e5>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><3e8>: Abbrev Number: 33 (DW_TAG_variable)
    <3e9>   DW_AT_name        : puc
    <3ed>   DW_AT_decl_file   : 1
    <3ee>   DW_AT_decl_line   : 230
    <3ef>   DW_AT_decl_column : 10
    <3f0>   DW_AT_type        : <0xd8>
    <3f4>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><3f7>: Abbrev Number: 1 (DW_TAG_variable)
    <3f8>   DW_AT_name        : (indirect string, offset: 0x6985): pxLink
    <3fc>   DW_AT_decl_file   : 1
    <3fc>   DW_AT_decl_line   : 231
    <3fd>   DW_AT_decl_column : 14
    <3fe>   DW_AT_type        : <0x169>
    <402>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><405>: Abbrev Number: 11 (DW_TAG_inlined_subroutine)
    <406>   DW_AT_abstract_origin: <0x4ec>
    <40a>   DW_AT_low_pc      : 0x80008ca
    <40e>   DW_AT_high_pc     : 0x14
    <412>   DW_AT_call_file   : 1
    <412>   DW_AT_call_line   : 243
    <413>   DW_AT_call_column : 3
    <414>   DW_AT_sibling     : <0x421>
 <3><418>: Abbrev Number: 6 (DW_TAG_variable)
    <419>   DW_AT_abstract_origin: <0x4f5>
    <41d>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <3><420>: Abbrev Number: 0
 <2><421>: Abbrev Number: 16 (DW_TAG_inlined_subroutine)
    <422>   DW_AT_abstract_origin: <0x4ec>
    <426>   DW_AT_low_pc      : 0x80008ea
    <42a>   DW_AT_high_pc     : 0x14
    <42e>   DW_AT_call_file   : 1
    <42e>   DW_AT_call_line   : 244
    <42f>   DW_AT_call_column : 3
 <3><430>: Abbrev Number: 6 (DW_TAG_variable)
    <431>   DW_AT_abstract_origin: <0x4f5>
    <435>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <3><438>: Abbrev Number: 0
 <2><439>: Abbrev Number: 0
 <1><43a>: Abbrev Number: 34 (DW_TAG_subprogram)
    <43b>   DW_AT_external    : 1
    <43b>   DW_AT_name        : (indirect string, offset: 0x2e0a): pvPortMallocMicroROS
    <43f>   DW_AT_decl_file   : 1
    <440>   DW_AT_decl_line   : 78
    <441>   DW_AT_decl_column : 7
    <442>   DW_AT_prototyped  : 1
    <442>   DW_AT_type        : <0xa0>
    <446>   DW_AT_low_pc      : 0x800070c
    <44a>   DW_AT_high_pc     : 0x190
    <44e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <450>   DW_AT_call_all_tail_calls: 1
    <450>   DW_AT_sibling     : <0x4ec>
 <2><454>: Abbrev Number: 35 (DW_TAG_formal_parameter)
    <455>   DW_AT_name        : (indirect string, offset: 0x4b7f): xWantedSize
    <459>   DW_AT_decl_file   : 1
    <45a>   DW_AT_decl_line   : 78
    <45b>   DW_AT_decl_column : 36
    <45c>   DW_AT_type        : <0x2a>
    <460>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><463>: Abbrev Number: 1 (DW_TAG_variable)
    <464>   DW_AT_name        : (indirect string, offset: 0x5a4b): pxBlock
    <468>   DW_AT_decl_file   : 1
    <468>   DW_AT_decl_line   : 80
    <469>   DW_AT_decl_column : 14
    <46a>   DW_AT_type        : <0x169>
    <46e>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><471>: Abbrev Number: 1 (DW_TAG_variable)
    <472>   DW_AT_name        : (indirect string, offset: 0x777a): pxPreviousBlock
    <476>   DW_AT_decl_file   : 1
    <476>   DW_AT_decl_line   : 80
    <477>   DW_AT_decl_column : 24
    <478>   DW_AT_type        : <0x169>
    <47c>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><47f>: Abbrev Number: 1 (DW_TAG_variable)
    <480>   DW_AT_name        : (indirect string, offset: 0x501e): pxNewBlockLink
    <484>   DW_AT_decl_file   : 1
    <484>   DW_AT_decl_line   : 80
    <485>   DW_AT_decl_column : 42
    <486>   DW_AT_type        : <0x169>
    <48a>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><48d>: Abbrev Number: 1 (DW_TAG_variable)
    <48e>   DW_AT_name        : (indirect string, offset: 0x6522): pvReturn
    <492>   DW_AT_decl_file   : 1
    <492>   DW_AT_decl_line   : 81
    <493>   DW_AT_decl_column : 7
    <494>   DW_AT_type        : <0xa0>
    <498>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><49b>: Abbrev Number: 11 (DW_TAG_inlined_subroutine)
    <49c>   DW_AT_abstract_origin: <0x4ec>
    <4a0>   DW_AT_low_pc      : 0x8000762
    <4a4>   DW_AT_high_pc     : 0x14
    <4a8>   DW_AT_call_file   : 1
    <4a8>   DW_AT_call_line   : 114
    <4a9>   DW_AT_call_column : 6
    <4aa>   DW_AT_sibling     : <0x4b7>
 <3><4ae>: Abbrev Number: 6 (DW_TAG_variable)
    <4af>   DW_AT_abstract_origin: <0x4f5>
    <4b3>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <3><4b6>: Abbrev Number: 0
 <2><4b7>: Abbrev Number: 11 (DW_TAG_inlined_subroutine)
    <4b8>   DW_AT_abstract_origin: <0x4ec>
    <4bc>   DW_AT_low_pc      : 0x80007f0
    <4c0>   DW_AT_high_pc     : 0x14
    <4c4>   DW_AT_call_file   : 1
    <4c4>   DW_AT_call_line   : 159
    <4c5>   DW_AT_call_column : 7
    <4c6>   DW_AT_sibling     : <0x4d3>
 <3><4ca>: Abbrev Number: 6 (DW_TAG_variable)
    <4cb>   DW_AT_abstract_origin: <0x4f5>
    <4cf>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><4d2>: Abbrev Number: 0
 <2><4d3>: Abbrev Number: 16 (DW_TAG_inlined_subroutine)
    <4d4>   DW_AT_abstract_origin: <0x4ec>
    <4d8>   DW_AT_low_pc      : 0x8000864
    <4dc>   DW_AT_high_pc     : 0x14
    <4e0>   DW_AT_call_file   : 1
    <4e0>   DW_AT_call_line   : 223
    <4e1>   DW_AT_call_column : 2
 <3><4e2>: Abbrev Number: 6 (DW_TAG_variable)
    <4e3>   DW_AT_abstract_origin: <0x4f5>
    <4e7>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <3><4ea>: Abbrev Number: 0
 <2><4eb>: Abbrev Number: 0
 <1><4ec>: Abbrev Number: 36 (DW_TAG_subprogram)
    <4ed>   DW_AT_name        : (indirect string, offset: 0x9a0d): vPortRaiseBASEPRI
    <4f1>   DW_AT_decl_file   : 2
    <4f2>   DW_AT_decl_line   : 191
    <4f3>   DW_AT_decl_column : 30
    <4f4>   DW_AT_prototyped  : 1
    <4f4>   DW_AT_inline      : 3	(declared as inline and inlined)
 <2><4f5>: Abbrev Number: 37 (DW_TAG_variable)
    <4f6>   DW_AT_name        : (indirect string, offset: 0x742b): ulNewBASEPRI
    <4fa>   DW_AT_decl_file   : 2
    <4fb>   DW_AT_decl_line   : 193
    <4fc>   DW_AT_decl_column : 10
    <4fd>   DW_AT_type        : <0xc0>
 <2><501>: Abbrev Number: 0
 <1><502>: Abbrev Number: 0
  Compilation Unit @ offset 0x503:
   Length:        0x3799 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x27d
   Pointer Size:  4
 <0><50f>: Abbrev Number: 51 (DW_TAG_compile_unit)
    <510>   DW_AT_producer    : (indirect string, offset: 0x7931): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <514>   DW_AT_language    : 29	(C11)
    <515>   DW_AT_name        : (indirect string, offset: 0xc0f41): ../Core/Src/main.c
    <519>   DW_AT_comp_dir    : (indirect string, offset: 0x96c7): /home/vinh/STM32CubeIDE/workspace_microros/microros/Debug
    <51d>   DW_AT_ranges      : 0x59
    <521>   DW_AT_low_pc      : 0
    <525>   DW_AT_stmt_list   : 0x925
    <529>   DW_AT_macros      : 0x2516
 <1><52d>: Abbrev Number: 22 (DW_TAG_enumeration_type)
    <52e>   DW_AT_encoding    : 5	(signed)
    <52f>   DW_AT_byte_size   : 1
    <530>   DW_AT_type        : <0x752>
    <534>   DW_AT_decl_file   : 3
    <535>   DW_AT_decl_line   : 66
    <536>   DW_AT_decl_column : 1
    <537>   DW_AT_sibling     : <0x752>
 <2><53b>: Abbrev Number: 15 (DW_TAG_enumerator)
    <53c>   DW_AT_name        : (indirect string, offset: 0x292a9): NonMaskableInt_IRQn
    <540>   DW_AT_const_value : -14
 <2><541>: Abbrev Number: 15 (DW_TAG_enumerator)
    <542>   DW_AT_name        : (indirect string, offset: 0x6fc53): MemoryManagement_IRQn
    <546>   DW_AT_const_value : -12
 <2><547>: Abbrev Number: 15 (DW_TAG_enumerator)
    <548>   DW_AT_name        : (indirect string, offset: 0xa8c27): BusFault_IRQn
    <54c>   DW_AT_const_value : -11
 <2><54d>: Abbrev Number: 15 (DW_TAG_enumerator)
    <54e>   DW_AT_name        : (indirect string, offset: 0x90c1f): UsageFault_IRQn
    <552>   DW_AT_const_value : -10
 <2><553>: Abbrev Number: 15 (DW_TAG_enumerator)
    <554>   DW_AT_name        : (indirect string, offset: 0xd26b): SVCall_IRQn
    <558>   DW_AT_const_value : -5
 <2><559>: Abbrev Number: 15 (DW_TAG_enumerator)
    <55a>   DW_AT_name        : (indirect string, offset: 0x6fc8b): DebugMonitor_IRQn
    <55e>   DW_AT_const_value : -4
 <2><55f>: Abbrev Number: 15 (DW_TAG_enumerator)
    <560>   DW_AT_name        : (indirect string, offset: 0x7a027): PendSV_IRQn
    <564>   DW_AT_const_value : -2
 <2><565>: Abbrev Number: 15 (DW_TAG_enumerator)
    <566>   DW_AT_name        : (indirect string, offset: 0xadae1): SysTick_IRQn
    <56a>   DW_AT_const_value : -1
 <2><56b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <56c>   DW_AT_name        : (indirect string, offset: 0x95b65): WWDG_IRQn
    <570>   DW_AT_const_value : 0
 <2><571>: Abbrev Number: 2 (DW_TAG_enumerator)
    <572>   DW_AT_name        : (indirect string, offset: 0x29096): PVD_IRQn
    <576>   DW_AT_const_value : 1
 <2><577>: Abbrev Number: 2 (DW_TAG_enumerator)
    <578>   DW_AT_name        : (indirect string, offset: 0xce75b): TAMP_STAMP_IRQn
    <57c>   DW_AT_const_value : 2
 <2><57d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <57e>   DW_AT_name        : (indirect string, offset: 0x83f7b): RTC_WKUP_IRQn
    <582>   DW_AT_const_value : 3
 <2><583>: Abbrev Number: 2 (DW_TAG_enumerator)
    <584>   DW_AT_name        : (indirect string, offset: 0x372bd): FLASH_IRQn
    <588>   DW_AT_const_value : 4
 <2><589>: Abbrev Number: 2 (DW_TAG_enumerator)
    <58a>   DW_AT_name        : (indirect string, offset: 0xa835c): RCC_IRQn
    <58e>   DW_AT_const_value : 5
 <2><58f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <590>   DW_AT_name        : (indirect string, offset: 0x6fd39): EXTI0_IRQn
    <594>   DW_AT_const_value : 6
 <2><595>: Abbrev Number: 2 (DW_TAG_enumerator)
    <596>   DW_AT_name        : (indirect string, offset: 0xccb69): EXTI1_IRQn
    <59a>   DW_AT_const_value : 7
 <2><59b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <59c>   DW_AT_name        : (indirect string, offset: 0x5c542): EXTI2_IRQn
    <5a0>   DW_AT_const_value : 8
 <2><5a1>: Abbrev Number: 2 (DW_TAG_enumerator)
    <5a2>   DW_AT_name        : (indirect string, offset: 0xa95fd): EXTI3_IRQn
    <5a6>   DW_AT_const_value : 9
 <2><5a7>: Abbrev Number: 2 (DW_TAG_enumerator)
    <5a8>   DW_AT_name        : (indirect string, offset: 0x27211): EXTI4_IRQn
    <5ac>   DW_AT_const_value : 10
 <2><5ad>: Abbrev Number: 2 (DW_TAG_enumerator)
    <5ae>   DW_AT_name        : (indirect string, offset: 0x23ae6): DMA1_Stream0_IRQn
    <5b2>   DW_AT_const_value : 11
 <2><5b3>: Abbrev Number: 2 (DW_TAG_enumerator)
    <5b4>   DW_AT_name        : (indirect string, offset: 0x664f7): DMA1_Stream1_IRQn
    <5b8>   DW_AT_const_value : 12
 <2><5b9>: Abbrev Number: 2 (DW_TAG_enumerator)
    <5ba>   DW_AT_name        : (indirect string, offset: 0x61e69): DMA1_Stream2_IRQn
    <5be>   DW_AT_const_value : 13
 <2><5bf>: Abbrev Number: 2 (DW_TAG_enumerator)
    <5c0>   DW_AT_name        : (indirect string, offset: 0xbf5c8): DMA1_Stream3_IRQn
    <5c4>   DW_AT_const_value : 14
 <2><5c5>: Abbrev Number: 2 (DW_TAG_enumerator)
    <5c6>   DW_AT_name        : (indirect string, offset: 0x45dfc): DMA1_Stream4_IRQn
    <5ca>   DW_AT_const_value : 15
 <2><5cb>: Abbrev Number: 2 (DW_TAG_enumerator)
    <5cc>   DW_AT_name        : (indirect string, offset: 0xa2e6f): DMA1_Stream5_IRQn
    <5d0>   DW_AT_const_value : 16
 <2><5d1>: Abbrev Number: 2 (DW_TAG_enumerator)
    <5d2>   DW_AT_name        : (indirect string, offset: 0x334c1): DMA1_Stream6_IRQn
    <5d6>   DW_AT_const_value : 17
 <2><5d7>: Abbrev Number: 2 (DW_TAG_enumerator)
    <5d8>   DW_AT_name        : (indirect string, offset: 0x710e5): ADC_IRQn
    <5dc>   DW_AT_const_value : 18
 <2><5dd>: Abbrev Number: 2 (DW_TAG_enumerator)
    <5de>   DW_AT_name        : (indirect string, offset: 0xc35d8): CAN1_TX_IRQn
    <5e2>   DW_AT_const_value : 19
 <2><5e3>: Abbrev Number: 2 (DW_TAG_enumerator)
    <5e4>   DW_AT_name        : (indirect string, offset: 0x35b1f): CAN1_RX0_IRQn
    <5e8>   DW_AT_const_value : 20
 <2><5e9>: Abbrev Number: 2 (DW_TAG_enumerator)
    <5ea>   DW_AT_name        : (indirect string, offset: 0x91ee5): CAN1_RX1_IRQn
    <5ee>   DW_AT_const_value : 21
 <2><5ef>: Abbrev Number: 2 (DW_TAG_enumerator)
    <5f0>   DW_AT_name        : (indirect string, offset: 0x9195e): CAN1_SCE_IRQn
    <5f4>   DW_AT_const_value : 22
 <2><5f5>: Abbrev Number: 2 (DW_TAG_enumerator)
    <5f6>   DW_AT_name        : (indirect string, offset: 0xc13f8): EXTI9_5_IRQn
    <5fa>   DW_AT_const_value : 23
 <2><5fb>: Abbrev Number: 2 (DW_TAG_enumerator)
    <5fc>   DW_AT_name        : (indirect string, offset: 0x5e679): TIM1_BRK_TIM9_IRQn
    <600>   DW_AT_const_value : 24
 <2><601>: Abbrev Number: 2 (DW_TAG_enumerator)
    <602>   DW_AT_name        : (indirect string, offset: 0x800c9): TIM1_UP_TIM10_IRQn
    <606>   DW_AT_const_value : 25
 <2><607>: Abbrev Number: 2 (DW_TAG_enumerator)
    <608>   DW_AT_name        : (indirect string, offset: 0x64608): TIM1_TRG_COM_TIM11_IRQn
    <60c>   DW_AT_const_value : 26
 <2><60d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <60e>   DW_AT_name        : (indirect string, offset: 0x694fb): TIM1_CC_IRQn
    <612>   DW_AT_const_value : 27
 <2><613>: Abbrev Number: 2 (DW_TAG_enumerator)
    <614>   DW_AT_name        : (indirect string, offset: 0x21f45): TIM2_IRQn
    <618>   DW_AT_const_value : 28
 <2><619>: Abbrev Number: 2 (DW_TAG_enumerator)
    <61a>   DW_AT_name        : (indirect string, offset: 0x7eea7): TIM3_IRQn
    <61e>   DW_AT_const_value : 29
 <2><61f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <620>   DW_AT_name        : (indirect string, offset: 0xf0f7): TIM4_IRQn
    <624>   DW_AT_const_value : 30
 <2><625>: Abbrev Number: 2 (DW_TAG_enumerator)
    <626>   DW_AT_name        : (indirect string, offset: 0x4fdf6): I2C1_EV_IRQn
    <62a>   DW_AT_const_value : 31
 <2><62b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <62c>   DW_AT_name        : (indirect string, offset: 0x88fb9): I2C1_ER_IRQn
    <630>   DW_AT_const_value : 32
 <2><631>: Abbrev Number: 2 (DW_TAG_enumerator)
    <632>   DW_AT_name        : (indirect string, offset: 0x21b2d): I2C2_EV_IRQn
    <636>   DW_AT_const_value : 33
 <2><637>: Abbrev Number: 2 (DW_TAG_enumerator)
    <638>   DW_AT_name        : (indirect string, offset: 0x5a3fc): I2C2_ER_IRQn
    <63c>   DW_AT_const_value : 34
 <2><63d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <63e>   DW_AT_name        : (indirect string, offset: 0x21ce0): SPI1_IRQn
    <642>   DW_AT_const_value : 35
 <2><643>: Abbrev Number: 2 (DW_TAG_enumerator)
    <644>   DW_AT_name        : (indirect string, offset: 0x7eb7a): SPI2_IRQn
    <648>   DW_AT_const_value : 36
 <2><649>: Abbrev Number: 2 (DW_TAG_enumerator)
    <64a>   DW_AT_name        : (indirect string, offset: 0xa9d7e): USART1_IRQn
    <64e>   DW_AT_const_value : 37
 <2><64f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <650>   DW_AT_name        : (indirect string, offset: 0x3a79b): USART2_IRQn
    <654>   DW_AT_const_value : 38
 <2><655>: Abbrev Number: 2 (DW_TAG_enumerator)
    <656>   DW_AT_name        : (indirect string, offset: 0x96919): USART3_IRQn
    <65a>   DW_AT_const_value : 39
 <2><65b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <65c>   DW_AT_name        : (indirect string, offset: 0xb51a9): EXTI15_10_IRQn
    <660>   DW_AT_const_value : 40
 <2><661>: Abbrev Number: 2 (DW_TAG_enumerator)
    <662>   DW_AT_name        : (indirect string, offset: 0xb69bb): RTC_Alarm_IRQn
    <666>   DW_AT_const_value : 41
 <2><667>: Abbrev Number: 2 (DW_TAG_enumerator)
    <668>   DW_AT_name        : (indirect string, offset: 0x37240): OTG_FS_WKUP_IRQn
    <66c>   DW_AT_const_value : 42
 <2><66d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <66e>   DW_AT_name        : (indirect string, offset: 0xad5a5): TIM8_BRK_TIM12_IRQn
    <672>   DW_AT_const_value : 43
 <2><673>: Abbrev Number: 2 (DW_TAG_enumerator)
    <674>   DW_AT_name        : (indirect string, offset: 0x9b0cf): TIM8_UP_TIM13_IRQn
    <678>   DW_AT_const_value : 44
 <2><679>: Abbrev Number: 2 (DW_TAG_enumerator)
    <67a>   DW_AT_name        : (indirect string, offset: 0x953bb): TIM8_TRG_COM_TIM14_IRQn
    <67e>   DW_AT_const_value : 45
 <2><67f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <680>   DW_AT_name        : (indirect string, offset: 0xa3734): TIM8_CC_IRQn
    <684>   DW_AT_const_value : 46
 <2><685>: Abbrev Number: 2 (DW_TAG_enumerator)
    <686>   DW_AT_name        : (indirect string, offset: 0x86b84): DMA1_Stream7_IRQn
    <68a>   DW_AT_const_value : 47
 <2><68b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <68c>   DW_AT_name        : (indirect string, offset: 0x29712): FSMC_IRQn
    <690>   DW_AT_const_value : 48
 <2><691>: Abbrev Number: 2 (DW_TAG_enumerator)
    <692>   DW_AT_name        : (indirect string, offset: 0x505c5): SDIO_IRQn
    <696>   DW_AT_const_value : 49
 <2><697>: Abbrev Number: 2 (DW_TAG_enumerator)
    <698>   DW_AT_name        : (indirect string, offset: 0x625df): TIM5_IRQn
    <69c>   DW_AT_const_value : 50
 <2><69d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <69e>   DW_AT_name        : (indirect string, offset: 0xd2a99): SPI3_IRQn
    <6a2>   DW_AT_const_value : 51
 <2><6a3>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6a4>   DW_AT_name        : (indirect string, offset: 0x9690e): UART4_IRQn
    <6a8>   DW_AT_const_value : 52
 <2><6a9>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6aa>   DW_AT_name        : (indirect string, offset: 0x1d7c0): UART5_IRQn
    <6ae>   DW_AT_const_value : 53
 <2><6af>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6b0>   DW_AT_name        : (indirect string, offset: 0xd6cbc): TIM6_DAC_IRQn
    <6b4>   DW_AT_const_value : 54
 <2><6b5>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6b6>   DW_AT_name        : (indirect string, offset: 0x720bc): TIM7_IRQn
    <6ba>   DW_AT_const_value : 55
 <2><6bb>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6bc>   DW_AT_name        : (indirect string, offset: 0x92bd7): DMA2_Stream0_IRQn
    <6c0>   DW_AT_const_value : 56
 <2><6c1>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6c2>   DW_AT_name        : (indirect string, offset: 0x234d7): DMA2_Stream1_IRQn
    <6c6>   DW_AT_const_value : 57
 <2><6c7>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6c8>   DW_AT_name        : (indirect string, offset: 0x767a6): DMA2_Stream2_IRQn
    <6cc>   DW_AT_const_value : 58
 <2><6cd>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6ce>   DW_AT_name        : (indirect string, offset: 0xbc69c): DMA2_Stream3_IRQn
    <6d2>   DW_AT_const_value : 59
 <2><6d3>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6d4>   DW_AT_name        : (indirect string, offset: 0x46909): DMA2_Stream4_IRQn
    <6d8>   DW_AT_const_value : 60
 <2><6d9>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6da>   DW_AT_name        : (indirect string, offset: 0x494bf): ETH_IRQn
    <6de>   DW_AT_const_value : 61
 <2><6df>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6e0>   DW_AT_name        : (indirect string, offset: 0x53467): ETH_WKUP_IRQn
    <6e4>   DW_AT_const_value : 62
 <2><6e5>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6e6>   DW_AT_name        : (indirect string, offset: 0x71b72): CAN2_TX_IRQn
    <6ea>   DW_AT_const_value : 63
 <2><6eb>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6ec>   DW_AT_name        : (indirect string, offset: 0x304f6): CAN2_RX0_IRQn
    <6f0>   DW_AT_const_value : 64
 <2><6f1>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6f2>   DW_AT_name        : (indirect string, offset: 0x8ce50): CAN2_RX1_IRQn
    <6f6>   DW_AT_const_value : 65
 <2><6f7>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6f8>   DW_AT_name        : (indirect string, offset: 0xcbb73): CAN2_SCE_IRQn
    <6fc>   DW_AT_const_value : 66
 <2><6fd>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6fe>   DW_AT_name        : (indirect string, offset: 0x7f145): OTG_FS_IRQn
    <702>   DW_AT_const_value : 67
 <2><703>: Abbrev Number: 2 (DW_TAG_enumerator)
    <704>   DW_AT_name        : (indirect string, offset: 0x89da2): DMA2_Stream5_IRQn
    <708>   DW_AT_const_value : 68
 <2><709>: Abbrev Number: 2 (DW_TAG_enumerator)
    <70a>   DW_AT_name        : (indirect string, offset: 0x46f49): DMA2_Stream6_IRQn
    <70e>   DW_AT_const_value : 69
 <2><70f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <710>   DW_AT_name        : (indirect string, offset: 0xa3ebf): DMA2_Stream7_IRQn
    <714>   DW_AT_const_value : 70
 <2><715>: Abbrev Number: 2 (DW_TAG_enumerator)
    <716>   DW_AT_name        : (indirect string, offset: 0x5c812): USART6_IRQn
    <71a>   DW_AT_const_value : 71
 <2><71b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <71c>   DW_AT_name        : (indirect string, offset: 0xc11ba): I2C3_EV_IRQn
    <720>   DW_AT_const_value : 72
 <2><721>: Abbrev Number: 2 (DW_TAG_enumerator)
    <722>   DW_AT_name        : (indirect string, offset: 0x2d139): I2C3_ER_IRQn
    <726>   DW_AT_const_value : 73
 <2><727>: Abbrev Number: 2 (DW_TAG_enumerator)
    <728>   DW_AT_name        : (indirect string, offset: 0x4ebb8): OTG_HS_EP1_OUT_IRQn
    <72c>   DW_AT_const_value : 74
 <2><72d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <72e>   DW_AT_name        : (indirect string, offset: 0xd68f7): OTG_HS_EP1_IN_IRQn
    <732>   DW_AT_const_value : 75
 <2><733>: Abbrev Number: 2 (DW_TAG_enumerator)
    <734>   DW_AT_name        : (indirect string, offset: 0x7e592): OTG_HS_WKUP_IRQn
    <738>   DW_AT_const_value : 76
 <2><739>: Abbrev Number: 2 (DW_TAG_enumerator)
    <73a>   DW_AT_name        : (indirect string, offset: 0x5e765): OTG_HS_IRQn
    <73e>   DW_AT_const_value : 77
 <2><73f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <740>   DW_AT_name        : (indirect string, offset: 0xca639): DCMI_IRQn
    <744>   DW_AT_const_value : 78
 <2><745>: Abbrev Number: 2 (DW_TAG_enumerator)
    <746>   DW_AT_name        : (indirect string, offset: 0xc2fe0): RNG_IRQn
    <74a>   DW_AT_const_value : 80
 <2><74b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <74c>   DW_AT_name        : (indirect string, offset: 0x4d019): FPU_IRQn
    <750>   DW_AT_const_value : 81
 <2><751>: Abbrev Number: 0
 <1><752>: Abbrev Number: 17 (DW_TAG_base_type)
    <753>   DW_AT_byte_size   : 1
    <754>   DW_AT_encoding    : 6	(signed char)
    <755>   DW_AT_name        : (indirect string, offset: 0x8a5): signed char
 <1><759>: Abbrev Number: 4 (DW_TAG_typedef)
    <75a>   DW_AT_name        : (indirect string, offset: 0xbd3cf): IRQn_Type
    <75e>   DW_AT_decl_file   : 3
    <75f>   DW_AT_decl_line   : 158
    <760>   DW_AT_decl_column : 3
    <761>   DW_AT_type        : <0x52d>
 <1><765>: Abbrev Number: 4 (DW_TAG_typedef)
    <766>   DW_AT_name        : (indirect string, offset: 0x1503d): __int8_t
    <76a>   DW_AT_decl_file   : 4
    <76b>   DW_AT_decl_line   : 41
    <76c>   DW_AT_decl_column : 23
    <76d>   DW_AT_type        : <0x752>
 <1><771>: Abbrev Number: 4 (DW_TAG_typedef)
    <772>   DW_AT_name        : (indirect string, offset: 0x163a): __uint8_t
    <776>   DW_AT_decl_file   : 4
    <777>   DW_AT_decl_line   : 43
    <778>   DW_AT_decl_column : 24
    <779>   DW_AT_type        : <0x77d>
 <1><77d>: Abbrev Number: 17 (DW_TAG_base_type)
    <77e>   DW_AT_byte_size   : 1
    <77f>   DW_AT_encoding    : 8	(unsigned char)
    <780>   DW_AT_name        : (indirect string, offset: 0x3e56): unsigned char
 <1><784>: Abbrev Number: 17 (DW_TAG_base_type)
    <785>   DW_AT_byte_size   : 2
    <786>   DW_AT_encoding    : 5	(signed)
    <787>   DW_AT_name        : (indirect string, offset: 0xb38): short int
 <1><78b>: Abbrev Number: 4 (DW_TAG_typedef)
    <78c>   DW_AT_name        : (indirect string, offset: 0xb18dc): __uint16_t
    <790>   DW_AT_decl_file   : 4
    <791>   DW_AT_decl_line   : 57
    <792>   DW_AT_decl_column : 25
    <793>   DW_AT_type        : <0x797>
 <1><797>: Abbrev Number: 17 (DW_TAG_base_type)
    <798>   DW_AT_byte_size   : 2
    <799>   DW_AT_encoding    : 7	(unsigned)
    <79a>   DW_AT_name        : (indirect string, offset: 0x80bd): short unsigned int
 <1><79e>: Abbrev Number: 4 (DW_TAG_typedef)
    <79f>   DW_AT_name        : (indirect string, offset: 0x8909f): __int32_t
    <7a3>   DW_AT_decl_file   : 4
    <7a4>   DW_AT_decl_line   : 77
    <7a5>   DW_AT_decl_column : 24
    <7a6>   DW_AT_type        : <0x7aa>
 <1><7aa>: Abbrev Number: 17 (DW_TAG_base_type)
    <7ab>   DW_AT_byte_size   : 4
    <7ac>   DW_AT_encoding    : 5	(signed)
    <7ad>   DW_AT_name        : (indirect string, offset: 0x857a): long int
 <1><7b1>: Abbrev Number: 4 (DW_TAG_typedef)
    <7b2>   DW_AT_name        : (indirect string, offset: 0x4fb4): __uint32_t
    <7b6>   DW_AT_decl_file   : 4
    <7b7>   DW_AT_decl_line   : 79
    <7b8>   DW_AT_decl_column : 25
    <7b9>   DW_AT_type        : <0x7bd>
 <1><7bd>: Abbrev Number: 17 (DW_TAG_base_type)
    <7be>   DW_AT_byte_size   : 4
    <7bf>   DW_AT_encoding    : 7	(unsigned)
    <7c0>   DW_AT_name        : (indirect string, offset: 0x224c): long unsigned int
 <1><7c4>: Abbrev Number: 4 (DW_TAG_typedef)
    <7c5>   DW_AT_name        : (indirect string, offset: 0x648eb): __int64_t
    <7c9>   DW_AT_decl_file   : 4
    <7ca>   DW_AT_decl_line   : 103
    <7cb>   DW_AT_decl_column : 24
    <7cc>   DW_AT_type        : <0x7d0>
 <1><7d0>: Abbrev Number: 17 (DW_TAG_base_type)
    <7d1>   DW_AT_byte_size   : 8
    <7d2>   DW_AT_encoding    : 5	(signed)
    <7d3>   DW_AT_name        : (indirect string, offset: 0x61c5): long long int
 <1><7d7>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d8>   DW_AT_name        : (indirect string, offset: 0x692df): __uint64_t
    <7dc>   DW_AT_decl_file   : 4
    <7dd>   DW_AT_decl_line   : 105
    <7de>   DW_AT_decl_column : 25
    <7df>   DW_AT_type        : <0x7e3>
 <1><7e3>: Abbrev Number: 17 (DW_TAG_base_type)
    <7e4>   DW_AT_byte_size   : 8
    <7e5>   DW_AT_encoding    : 7	(unsigned)
    <7e6>   DW_AT_name        : (indirect string, offset: 0x26ab): long long unsigned int
 <1><7ea>: Abbrev Number: 52 (DW_TAG_base_type)
    <7eb>   DW_AT_byte_size   : 4
    <7ec>   DW_AT_encoding    : 5	(signed)
    <7ed>   DW_AT_name        : int
 <1><7f1>: Abbrev Number: 17 (DW_TAG_base_type)
    <7f2>   DW_AT_byte_size   : 4
    <7f3>   DW_AT_encoding    : 7	(unsigned)
    <7f4>   DW_AT_name        : (indirect string, offset: 0x2ad6): unsigned int
 <1><7f8>: Abbrev Number: 4 (DW_TAG_typedef)
    <7f9>   DW_AT_name        : (indirect string, offset: 0x1503f): int8_t
    <7fd>   DW_AT_decl_file   : 5
    <7fe>   DW_AT_decl_line   : 20
    <7ff>   DW_AT_decl_column : 18
    <800>   DW_AT_type        : <0x765>
 <1><804>: Abbrev Number: 4 (DW_TAG_typedef)
    <805>   DW_AT_name        : (indirect string, offset: 0x163c): uint8_t
    <809>   DW_AT_decl_file   : 5
    <80a>   DW_AT_decl_line   : 24
    <80b>   DW_AT_decl_column : 19
    <80c>   DW_AT_type        : <0x771>
 <1><810>: Abbrev Number: 10 (DW_TAG_const_type)
    <811>   DW_AT_type        : <0x804>
 <1><815>: Abbrev Number: 4 (DW_TAG_typedef)
    <816>   DW_AT_name        : (indirect string, offset: 0x4afd): uint16_t
    <81a>   DW_AT_decl_file   : 5
    <81b>   DW_AT_decl_line   : 36
    <81c>   DW_AT_decl_column : 20
    <81d>   DW_AT_type        : <0x78b>
 <1><821>: Abbrev Number: 23 (DW_TAG_volatile_type)
    <822>   DW_AT_type        : <0x815>
 <1><826>: Abbrev Number: 4 (DW_TAG_typedef)
    <827>   DW_AT_name        : (indirect string, offset: 0x890a1): int32_t
    <82b>   DW_AT_decl_file   : 5
    <82c>   DW_AT_decl_line   : 44
    <82d>   DW_AT_decl_column : 19
    <82e>   DW_AT_type        : <0x79e>
 <1><832>: Abbrev Number: 4 (DW_TAG_typedef)
    <833>   DW_AT_name        : (indirect string, offset: 0xa0ab): uint32_t
    <837>   DW_AT_decl_file   : 5
    <838>   DW_AT_decl_line   : 48
    <839>   DW_AT_decl_column : 20
    <83a>   DW_AT_type        : <0x7b1>
 <1><83e>: Abbrev Number: 23 (DW_TAG_volatile_type)
    <83f>   DW_AT_type        : <0x832>
 <1><843>: Abbrev Number: 4 (DW_TAG_typedef)
    <844>   DW_AT_name        : (indirect string, offset: 0x648ed): int64_t
    <848>   DW_AT_decl_file   : 5
    <849>   DW_AT_decl_line   : 56
    <84a>   DW_AT_decl_column : 19
    <84b>   DW_AT_type        : <0x7c4>
 <1><84f>: Abbrev Number: 4 (DW_TAG_typedef)
    <850>   DW_AT_name        : (indirect string, offset: 0x692e1): uint64_t
    <854>   DW_AT_decl_file   : 5
    <855>   DW_AT_decl_line   : 60
    <856>   DW_AT_decl_column : 20
    <857>   DW_AT_type        : <0x7d7>
 <1><85b>: Abbrev Number: 10 (DW_TAG_const_type)
    <85c>   DW_AT_type        : <0x84f>
 <1><860>: Abbrev Number: 27 (DW_TAG_array_type)
    <861>   DW_AT_type        : <0x832>
    <865>   DW_AT_sibling     : <0x870>
 <2><869>: Abbrev Number: 29 (DW_TAG_subrange_type)
    <86a>   DW_AT_type        : <0x7f1>
    <86e>   DW_AT_upper_bound : 1
 <2><86f>: Abbrev Number: 0
 <1><870>: Abbrev Number: 30 (DW_TAG_structure_type)
    <871>   DW_AT_byte_size   : 24
    <872>   DW_AT_decl_file   : 3
    <873>   DW_AT_decl_line   : 345
    <875>   DW_AT_decl_column : 9
    <875>   DW_AT_sibling     : <0x8c7>
 <2><879>: Abbrev Number: 9 (DW_TAG_member)
    <87a>   DW_AT_name        : CR
    <87d>   DW_AT_decl_file   : 3
    <87d>   DW_AT_decl_line   : 347
    <87f>   DW_AT_decl_column : 17
    <87f>   DW_AT_type        : <0x83e>
    <883>   DW_AT_data_member_location: 0
 <2><884>: Abbrev Number: 6 (DW_TAG_member)
    <885>   DW_AT_name        : (indirect string, offset: 0x585bf): NDTR
    <889>   DW_AT_decl_file   : 3
    <88a>   DW_AT_decl_line   : 348
    <88c>   DW_AT_decl_column : 17
    <88d>   DW_AT_type        : <0x83e>
    <891>   DW_AT_data_member_location: 4
 <2><892>: Abbrev Number: 9 (DW_TAG_member)
    <893>   DW_AT_name        : PAR
    <897>   DW_AT_decl_file   : 3
    <897>   DW_AT_decl_line   : 349
    <899>   DW_AT_decl_column : 17
    <899>   DW_AT_type        : <0x83e>
    <89d>   DW_AT_data_member_location: 8
 <2><89e>: Abbrev Number: 6 (DW_TAG_member)
    <89f>   DW_AT_name        : (indirect string, offset: 0x5fb0e): M0AR
    <8a3>   DW_AT_decl_file   : 3
    <8a4>   DW_AT_decl_line   : 350
    <8a6>   DW_AT_decl_column : 17
    <8a7>   DW_AT_type        : <0x83e>
    <8ab>   DW_AT_data_member_location: 12
 <2><8ac>: Abbrev Number: 6 (DW_TAG_member)
    <8ad>   DW_AT_name        : (indirect string, offset: 0x7c13e): M1AR
    <8b1>   DW_AT_decl_file   : 3
    <8b2>   DW_AT_decl_line   : 351
    <8b4>   DW_AT_decl_column : 17
    <8b5>   DW_AT_type        : <0x83e>
    <8b9>   DW_AT_data_member_location: 16
 <2><8ba>: Abbrev Number: 9 (DW_TAG_member)
    <8bb>   DW_AT_name        : FCR
    <8bf>   DW_AT_decl_file   : 3
    <8bf>   DW_AT_decl_line   : 352
    <8c1>   DW_AT_decl_column : 17
    <8c1>   DW_AT_type        : <0x83e>
    <8c5>   DW_AT_data_member_location: 20
 <2><8c6>: Abbrev Number: 0
 <1><8c7>: Abbrev Number: 18 (DW_TAG_typedef)
    <8c8>   DW_AT_name        : (indirect string, offset: 0xc4686): DMA_Stream_TypeDef
    <8cc>   DW_AT_decl_file   : 3
    <8cd>   DW_AT_decl_line   : 353
    <8cf>   DW_AT_decl_column : 3
    <8cf>   DW_AT_type        : <0x870>
 <1><8d3>: Abbrev Number: 30 (DW_TAG_structure_type)
    <8d4>   DW_AT_byte_size   : 40
    <8d5>   DW_AT_decl_file   : 3
    <8d6>   DW_AT_decl_line   : 526
    <8d8>   DW_AT_decl_column : 9
    <8d8>   DW_AT_sibling     : <0x955>
 <2><8dc>: Abbrev Number: 6 (DW_TAG_member)
    <8dd>   DW_AT_name        : (indirect string, offset: 0xc6dc): MODER
    <8e1>   DW_AT_decl_file   : 3
    <8e2>   DW_AT_decl_line   : 528
    <8e4>   DW_AT_decl_column : 17
    <8e5>   DW_AT_type        : <0x83e>
    <8e9>   DW_AT_data_member_location: 0
 <2><8ea>: Abbrev Number: 6 (DW_TAG_member)
    <8eb>   DW_AT_name        : (indirect string, offset: 0xcbbdb): OTYPER
    <8ef>   DW_AT_decl_file   : 3
    <8f0>   DW_AT_decl_line   : 529
    <8f2>   DW_AT_decl_column : 17
    <8f3>   DW_AT_type        : <0x83e>
    <8f7>   DW_AT_data_member_location: 4
 <2><8f8>: Abbrev Number: 6 (DW_TAG_member)
    <8f9>   DW_AT_name        : (indirect string, offset: 0xbc4de): OSPEEDR
    <8fd>   DW_AT_decl_file   : 3
    <8fe>   DW_AT_decl_line   : 530
    <900>   DW_AT_decl_column : 17
    <901>   DW_AT_type        : <0x83e>
    <905>   DW_AT_data_member_location: 8
 <2><906>: Abbrev Number: 6 (DW_TAG_member)
    <907>   DW_AT_name        : (indirect string, offset: 0x9cd18): PUPDR
    <90b>   DW_AT_decl_file   : 3
    <90c>   DW_AT_decl_line   : 531
    <90e>   DW_AT_decl_column : 17
    <90f>   DW_AT_type        : <0x83e>
    <913>   DW_AT_data_member_location: 12
 <2><914>: Abbrev Number: 9 (DW_TAG_member)
    <915>   DW_AT_name        : IDR
    <919>   DW_AT_decl_file   : 3
    <919>   DW_AT_decl_line   : 532
    <91b>   DW_AT_decl_column : 17
    <91b>   DW_AT_type        : <0x83e>
    <91f>   DW_AT_data_member_location: 16
 <2><920>: Abbrev Number: 9 (DW_TAG_member)
    <921>   DW_AT_name        : ODR
    <925>   DW_AT_decl_file   : 3
    <925>   DW_AT_decl_line   : 533
    <927>   DW_AT_decl_column : 17
    <927>   DW_AT_type        : <0x83e>
    <92b>   DW_AT_data_member_location: 20
 <2><92c>: Abbrev Number: 6 (DW_TAG_member)
    <92d>   DW_AT_name        : (indirect string, offset: 0x3959d): BSRR
    <931>   DW_AT_decl_file   : 3
    <932>   DW_AT_decl_line   : 534
    <934>   DW_AT_decl_column : 17
    <935>   DW_AT_type        : <0x83e>
    <939>   DW_AT_data_member_location: 24
 <2><93a>: Abbrev Number: 6 (DW_TAG_member)
    <93b>   DW_AT_name        : (indirect string, offset: 0xb9b61): LCKR
    <93f>   DW_AT_decl_file   : 3
    <940>   DW_AT_decl_line   : 535
    <942>   DW_AT_decl_column : 17
    <943>   DW_AT_type        : <0x83e>
    <947>   DW_AT_data_member_location: 28
 <2><948>: Abbrev Number: 9 (DW_TAG_member)
    <949>   DW_AT_name        : AFR
    <94d>   DW_AT_decl_file   : 3
    <94d>   DW_AT_decl_line   : 536
    <94f>   DW_AT_decl_column : 17
    <94f>   DW_AT_type        : <0x965>
    <953>   DW_AT_data_member_location: 32
 <2><954>: Abbrev Number: 0
 <1><955>: Abbrev Number: 27 (DW_TAG_array_type)
    <956>   DW_AT_type        : <0x83e>
    <95a>   DW_AT_sibling     : <0x965>
 <2><95e>: Abbrev Number: 29 (DW_TAG_subrange_type)
    <95f>   DW_AT_type        : <0x7f1>
    <963>   DW_AT_upper_bound : 1
 <2><964>: Abbrev Number: 0
 <1><965>: Abbrev Number: 23 (DW_TAG_volatile_type)
    <966>   DW_AT_type        : <0x955>
 <1><96a>: Abbrev Number: 18 (DW_TAG_typedef)
    <96b>   DW_AT_name        : (indirect string, offset: 0xd1421): GPIO_TypeDef
    <96f>   DW_AT_decl_file   : 3
    <970>   DW_AT_decl_line   : 537
    <972>   DW_AT_decl_column : 3
    <972>   DW_AT_type        : <0x8d3>
 <1><976>: Abbrev Number: 30 (DW_TAG_structure_type)
    <977>   DW_AT_byte_size   : 8
    <978>   DW_AT_decl_file   : 3
    <979>   DW_AT_decl_line   : 586
    <97b>   DW_AT_decl_column : 9
    <97b>   DW_AT_sibling     : <0x997>
 <2><97f>: Abbrev Number: 9 (DW_TAG_member)
    <980>   DW_AT_name        : CR
    <983>   DW_AT_decl_file   : 3
    <983>   DW_AT_decl_line   : 588
    <985>   DW_AT_decl_column : 17
    <985>   DW_AT_type        : <0x83e>
    <989>   DW_AT_data_member_location: 0
 <2><98a>: Abbrev Number: 9 (DW_TAG_member)
    <98b>   DW_AT_name        : CSR
    <98f>   DW_AT_decl_file   : 3
    <98f>   DW_AT_decl_line   : 589
    <991>   DW_AT_decl_column : 17
    <991>   DW_AT_type        : <0x83e>
    <995>   DW_AT_data_member_location: 4
 <2><996>: Abbrev Number: 0
 <1><997>: Abbrev Number: 18 (DW_TAG_typedef)
    <998>   DW_AT_name        : (indirect string, offset: 0x9e748): PWR_TypeDef
    <99c>   DW_AT_decl_file   : 3
    <99d>   DW_AT_decl_line   : 590
    <99f>   DW_AT_decl_column : 3
    <99f>   DW_AT_type        : <0x976>
 <1><9a3>: Abbrev Number: 30 (DW_TAG_structure_type)
    <9a4>   DW_AT_byte_size   : 136
    <9a5>   DW_AT_decl_file   : 3
    <9a6>   DW_AT_decl_line   : 596
    <9a8>   DW_AT_decl_column : 9
    <9a8>   DW_AT_sibling     : <0xb4a>
 <2><9ac>: Abbrev Number: 9 (DW_TAG_member)
    <9ad>   DW_AT_name        : CR
    <9b0>   DW_AT_decl_file   : 3
    <9b0>   DW_AT_decl_line   : 598
    <9b2>   DW_AT_decl_column : 17
    <9b2>   DW_AT_type        : <0x83e>
    <9b6>   DW_AT_data_member_location: 0
 <2><9b7>: Abbrev Number: 6 (DW_TAG_member)
    <9b8>   DW_AT_name        : (indirect string, offset: 0x99d6c): PLLCFGR
    <9bc>   DW_AT_decl_file   : 3
    <9bd>   DW_AT_decl_line   : 599
    <9bf>   DW_AT_decl_column : 17
    <9c0>   DW_AT_type        : <0x83e>
    <9c4>   DW_AT_data_member_location: 4
 <2><9c5>: Abbrev Number: 6 (DW_TAG_member)
    <9c6>   DW_AT_name        : (indirect string, offset: 0x99d6f): CFGR
    <9ca>   DW_AT_decl_file   : 3
    <9cb>   DW_AT_decl_line   : 600
    <9cd>   DW_AT_decl_column : 17
    <9ce>   DW_AT_type        : <0x83e>
    <9d2>   DW_AT_data_member_location: 8
 <2><9d3>: Abbrev Number: 9 (DW_TAG_member)
    <9d4>   DW_AT_name        : CIR
    <9d8>   DW_AT_decl_file   : 3
    <9d8>   DW_AT_decl_line   : 601
    <9da>   DW_AT_decl_column : 17
    <9da>   DW_AT_type        : <0x83e>
    <9de>   DW_AT_data_member_location: 12
 <2><9df>: Abbrev Number: 6 (DW_TAG_member)
    <9e0>   DW_AT_name        : (indirect string, offset: 0xad4a9): AHB1RSTR
    <9e4>   DW_AT_decl_file   : 3
    <9e5>   DW_AT_decl_line   : 602
    <9e7>   DW_AT_decl_column : 17
    <9e8>   DW_AT_type        : <0x83e>
    <9ec>   DW_AT_data_member_location: 16
 <2><9ed>: Abbrev Number: 6 (DW_TAG_member)
    <9ee>   DW_AT_name        : (indirect string, offset: 0x90229): AHB2RSTR
    <9f2>   DW_AT_decl_file   : 3
    <9f3>   DW_AT_decl_line   : 603
    <9f5>   DW_AT_decl_column : 17
    <9f6>   DW_AT_type        : <0x83e>
    <9fa>   DW_AT_data_member_location: 20
 <2><9fb>: Abbrev Number: 6 (DW_TAG_member)
    <9fc>   DW_AT_name        : (indirect string, offset: 0x4e077): AHB3RSTR
    <a00>   DW_AT_decl_file   : 3
    <a01>   DW_AT_decl_line   : 604
    <a03>   DW_AT_decl_column : 17
    <a04>   DW_AT_type        : <0x83e>
    <a08>   DW_AT_data_member_location: 24
 <2><a09>: Abbrev Number: 6 (DW_TAG_member)
    <a0a>   DW_AT_name        : (indirect string, offset: 0xcb912): RESERVED0
    <a0e>   DW_AT_decl_file   : 3
    <a0f>   DW_AT_decl_line   : 605
    <a11>   DW_AT_decl_column : 17
    <a12>   DW_AT_type        : <0x832>
    <a16>   DW_AT_data_member_location: 28
 <2><a17>: Abbrev Number: 6 (DW_TAG_member)
    <a18>   DW_AT_name        : (indirect string, offset: 0x21f02): APB1RSTR
    <a1c>   DW_AT_decl_file   : 3
    <a1d>   DW_AT_decl_line   : 606
    <a1f>   DW_AT_decl_column : 17
    <a20>   DW_AT_type        : <0x83e>
    <a24>   DW_AT_data_member_location: 32
 <2><a25>: Abbrev Number: 6 (DW_TAG_member)
    <a26>   DW_AT_name        : (indirect string, offset: 0x638ea): APB2RSTR
    <a2a>   DW_AT_decl_file   : 3
    <a2b>   DW_AT_decl_line   : 607
    <a2d>   DW_AT_decl_column : 17
    <a2e>   DW_AT_type        : <0x83e>
    <a32>   DW_AT_data_member_location: 36
 <2><a33>: Abbrev Number: 6 (DW_TAG_member)
    <a34>   DW_AT_name        : (indirect string, offset: 0xcb91c): RESERVED1
    <a38>   DW_AT_decl_file   : 3
    <a39>   DW_AT_decl_line   : 608
    <a3b>   DW_AT_decl_column : 17
    <a3c>   DW_AT_type        : <0x860>
    <a40>   DW_AT_data_member_location: 40
 <2><a41>: Abbrev Number: 6 (DW_TAG_member)
    <a42>   DW_AT_name        : (indirect string, offset: 0x1b6ab): AHB1ENR
    <a46>   DW_AT_decl_file   : 3
    <a47>   DW_AT_decl_line   : 609
    <a49>   DW_AT_decl_column : 17
    <a4a>   DW_AT_type        : <0x83e>
    <a4e>   DW_AT_data_member_location: 48
 <2><a4f>: Abbrev Number: 6 (DW_TAG_member)
    <a50>   DW_AT_name        : (indirect string, offset: 0x4146d): AHB2ENR
    <a54>   DW_AT_decl_file   : 3
    <a55>   DW_AT_decl_line   : 610
    <a57>   DW_AT_decl_column : 17
    <a58>   DW_AT_type        : <0x83e>
    <a5c>   DW_AT_data_member_location: 52
 <2><a5d>: Abbrev Number: 6 (DW_TAG_member)
    <a5e>   DW_AT_name        : (indirect string, offset: 0x66d3f): AHB3ENR
    <a62>   DW_AT_decl_file   : 3
    <a63>   DW_AT_decl_line   : 611
    <a65>   DW_AT_decl_column : 17
    <a66>   DW_AT_type        : <0x83e>
    <a6a>   DW_AT_data_member_location: 56
 <2><a6b>: Abbrev Number: 6 (DW_TAG_member)
    <a6c>   DW_AT_name        : (indirect string, offset: 0xcb926): RESERVED2
    <a70>   DW_AT_decl_file   : 3
    <a71>   DW_AT_decl_line   : 612
    <a73>   DW_AT_decl_column : 17
    <a74>   DW_AT_type        : <0x832>
    <a78>   DW_AT_data_member_location: 60
 <2><a79>: Abbrev Number: 6 (DW_TAG_member)
    <a7a>   DW_AT_name        : (indirect string, offset: 0x8029d): APB1ENR
    <a7e>   DW_AT_decl_file   : 3
    <a7f>   DW_AT_decl_line   : 613
    <a81>   DW_AT_decl_column : 17
    <a82>   DW_AT_type        : <0x83e>
    <a86>   DW_AT_data_member_location: 64
 <2><a87>: Abbrev Number: 6 (DW_TAG_member)
    <a88>   DW_AT_name        : (indirect string, offset: 0x235a2): APB2ENR
    <a8c>   DW_AT_decl_file   : 3
    <a8d>   DW_AT_decl_line   : 614
    <a8f>   DW_AT_decl_column : 17
    <a90>   DW_AT_type        : <0x83e>
    <a94>   DW_AT_data_member_location: 68
 <2><a95>: Abbrev Number: 6 (DW_TAG_member)
    <a96>   DW_AT_name        : (indirect string, offset: 0xcb930): RESERVED3
    <a9a>   DW_AT_decl_file   : 3
    <a9b>   DW_AT_decl_line   : 615
    <a9d>   DW_AT_decl_column : 17
    <a9e>   DW_AT_type        : <0x860>
    <aa2>   DW_AT_data_member_location: 72
 <2><aa3>: Abbrev Number: 6 (DW_TAG_member)
    <aa4>   DW_AT_name        : (indirect string, offset: 0xb1746): AHB1LPENR
    <aa8>   DW_AT_decl_file   : 3
    <aa9>   DW_AT_decl_line   : 616
    <aab>   DW_AT_decl_column : 17
    <aac>   DW_AT_type        : <0x83e>
    <ab0>   DW_AT_data_member_location: 80
 <2><ab1>: Abbrev Number: 6 (DW_TAG_member)
    <ab2>   DW_AT_name        : (indirect string, offset: 0x391cf): AHB2LPENR
    <ab6>   DW_AT_decl_file   : 3
    <ab7>   DW_AT_decl_line   : 617
    <ab9>   DW_AT_decl_column : 17
    <aba>   DW_AT_type        : <0x83e>
    <abe>   DW_AT_data_member_location: 84
 <2><abf>: Abbrev Number: 6 (DW_TAG_member)
    <ac0>   DW_AT_name        : (indirect string, offset: 0x952b8): AHB3LPENR
    <ac4>   DW_AT_decl_file   : 3
    <ac5>   DW_AT_decl_line   : 618
    <ac7>   DW_AT_decl_column : 17
    <ac8>   DW_AT_type        : <0x83e>
    <acc>   DW_AT_data_member_location: 88
 <2><acd>: Abbrev Number: 6 (DW_TAG_member)
    <ace>   DW_AT_name        : (indirect string, offset: 0xcb93a): RESERVED4
    <ad2>   DW_AT_decl_file   : 3
    <ad3>   DW_AT_decl_line   : 619
    <ad5>   DW_AT_decl_column : 17
    <ad6>   DW_AT_type        : <0x832>
    <ada>   DW_AT_data_member_location: 92
 <2><adb>: Abbrev Number: 6 (DW_TAG_member)
    <adc>   DW_AT_name        : (indirect string, offset: 0xb61a0): APB1LPENR
    <ae0>   DW_AT_decl_file   : 3
    <ae1>   DW_AT_decl_line   : 620
    <ae3>   DW_AT_decl_column : 17
    <ae4>   DW_AT_type        : <0x83e>
    <ae8>   DW_AT_data_member_location: 96
 <2><ae9>: Abbrev Number: 6 (DW_TAG_member)
    <aea>   DW_AT_name        : (indirect string, offset: 0x3ef10): APB2LPENR
    <aee>   DW_AT_decl_file   : 3
    <aef>   DW_AT_decl_line   : 621
    <af1>   DW_AT_decl_column : 17
    <af2>   DW_AT_type        : <0x83e>
    <af6>   DW_AT_data_member_location: 100
 <2><af7>: Abbrev Number: 6 (DW_TAG_member)
    <af8>   DW_AT_name        : (indirect string, offset: 0xcb944): RESERVED5
    <afc>   DW_AT_decl_file   : 3
    <afd>   DW_AT_decl_line   : 622
    <aff>   DW_AT_decl_column : 17
    <b00>   DW_AT_type        : <0x860>
    <b04>   DW_AT_data_member_location: 104
 <2><b05>: Abbrev Number: 6 (DW_TAG_member)
    <b06>   DW_AT_name        : (indirect string, offset: 0x2777c): BDCR
    <b0a>   DW_AT_decl_file   : 3
    <b0b>   DW_AT_decl_line   : 623
    <b0d>   DW_AT_decl_column : 17
    <b0e>   DW_AT_type        : <0x83e>
    <b12>   DW_AT_data_member_location: 112
 <2><b13>: Abbrev Number: 9 (DW_TAG_member)
    <b14>   DW_AT_name        : CSR
    <b18>   DW_AT_decl_file   : 3
    <b18>   DW_AT_decl_line   : 624
    <b1a>   DW_AT_decl_column : 17
    <b1a>   DW_AT_type        : <0x83e>
    <b1e>   DW_AT_data_member_location: 116
 <2><b1f>: Abbrev Number: 6 (DW_TAG_member)
    <b20>   DW_AT_name        : (indirect string, offset: 0x84ec8): RESERVED6
    <b24>   DW_AT_decl_file   : 3
    <b25>   DW_AT_decl_line   : 625
    <b27>   DW_AT_decl_column : 17
    <b28>   DW_AT_type        : <0x860>
    <b2c>   DW_AT_data_member_location: 120
 <2><b2d>: Abbrev Number: 6 (DW_TAG_member)
    <b2e>   DW_AT_name        : (indirect string, offset: 0x773e3): SSCGR
    <b32>   DW_AT_decl_file   : 3
    <b33>   DW_AT_decl_line   : 626
    <b35>   DW_AT_decl_column : 17
    <b36>   DW_AT_type        : <0x83e>
    <b3a>   DW_AT_data_member_location: 128
 <2><b3b>: Abbrev Number: 6 (DW_TAG_member)
    <b3c>   DW_AT_name        : (indirect string, offset: 0x4eaf9): PLLI2SCFGR
    <b40>   DW_AT_decl_file   : 3
    <b41>   DW_AT_decl_line   : 627
    <b43>   DW_AT_decl_column : 17
    <b44>   DW_AT_type        : <0x83e>
    <b48>   DW_AT_data_member_location: 132
 <2><b49>: Abbrev Number: 0
 <1><b4a>: Abbrev Number: 18 (DW_TAG_typedef)
    <b4b>   DW_AT_name        : (indirect string, offset: 0x69a16): RCC_TypeDef
    <b4f>   DW_AT_decl_file   : 3
    <b50>   DW_AT_decl_line   : 628
    <b52>   DW_AT_decl_column : 3
    <b52>   DW_AT_type        : <0x9a3>
 <1><b56>: Abbrev Number: 30 (DW_TAG_structure_type)
    <b57>   DW_AT_byte_size   : 84
    <b58>   DW_AT_decl_file   : 3
    <b59>   DW_AT_decl_line   : 728
    <b5b>   DW_AT_decl_column : 9
    <b5b>   DW_AT_sibling     : <0xc70>
 <2><b5f>: Abbrev Number: 9 (DW_TAG_member)
    <b60>   DW_AT_name        : CR1
    <b64>   DW_AT_decl_file   : 3
    <b64>   DW_AT_decl_line   : 730
    <b66>   DW_AT_decl_column : 17
    <b66>   DW_AT_type        : <0x83e>
    <b6a>   DW_AT_data_member_location: 0
 <2><b6b>: Abbrev Number: 9 (DW_TAG_member)
    <b6c>   DW_AT_name        : CR2
    <b70>   DW_AT_decl_file   : 3
    <b70>   DW_AT_decl_line   : 731
    <b72>   DW_AT_decl_column : 17
    <b72>   DW_AT_type        : <0x83e>
    <b76>   DW_AT_data_member_location: 4
 <2><b77>: Abbrev Number: 6 (DW_TAG_member)
    <b78>   DW_AT_name        : (indirect string, offset: 0x46e1b): SMCR
    <b7c>   DW_AT_decl_file   : 3
    <b7d>   DW_AT_decl_line   : 732
    <b7f>   DW_AT_decl_column : 17
    <b80>   DW_AT_type        : <0x83e>
    <b84>   DW_AT_data_member_location: 8
 <2><b85>: Abbrev Number: 6 (DW_TAG_member)
    <b86>   DW_AT_name        : (indirect string, offset: 0x4e580): DIER
    <b8a>   DW_AT_decl_file   : 3
    <b8b>   DW_AT_decl_line   : 733
    <b8d>   DW_AT_decl_column : 17
    <b8e>   DW_AT_type        : <0x83e>
    <b92>   DW_AT_data_member_location: 12
 <2><b93>: Abbrev Number: 9 (DW_TAG_member)
    <b94>   DW_AT_name        : SR
    <b97>   DW_AT_decl_file   : 3
    <b97>   DW_AT_decl_line   : 734
    <b99>   DW_AT_decl_column : 17
    <b99>   DW_AT_type        : <0x83e>
    <b9d>   DW_AT_data_member_location: 16
 <2><b9e>: Abbrev Number: 9 (DW_TAG_member)
    <b9f>   DW_AT_name        : EGR
    <ba3>   DW_AT_decl_file   : 3
    <ba3>   DW_AT_decl_line   : 735
    <ba5>   DW_AT_decl_column : 17
    <ba5>   DW_AT_type        : <0x83e>
    <ba9>   DW_AT_data_member_location: 20
 <2><baa>: Abbrev Number: 6 (DW_TAG_member)
    <bab>   DW_AT_name        : (indirect string, offset: 0xc54bf): CCMR1
    <baf>   DW_AT_decl_file   : 3
    <bb0>   DW_AT_decl_line   : 736
    <bb2>   DW_AT_decl_column : 17
    <bb3>   DW_AT_type        : <0x83e>
    <bb7>   DW_AT_data_member_location: 24
 <2><bb8>: Abbrev Number: 6 (DW_TAG_member)
    <bb9>   DW_AT_name        : (indirect string, offset: 0x5c56b): CCMR2
    <bbd>   DW_AT_decl_file   : 3
    <bbe>   DW_AT_decl_line   : 737
    <bc0>   DW_AT_decl_column : 17
    <bc1>   DW_AT_type        : <0x83e>
    <bc5>   DW_AT_data_member_location: 28
 <2><bc6>: Abbrev Number: 6 (DW_TAG_member)
    <bc7>   DW_AT_name        : (indirect string, offset: 0x3ce74): CCER
    <bcb>   DW_AT_decl_file   : 3
    <bcc>   DW_AT_decl_line   : 738
    <bce>   DW_AT_decl_column : 17
    <bcf>   DW_AT_type        : <0x83e>
    <bd3>   DW_AT_data_member_location: 32
 <2><bd4>: Abbrev Number: 9 (DW_TAG_member)
    <bd5>   DW_AT_name        : CNT
    <bd9>   DW_AT_decl_file   : 3
    <bd9>   DW_AT_decl_line   : 739
    <bdb>   DW_AT_decl_column : 17
    <bdb>   DW_AT_type        : <0x83e>
    <bdf>   DW_AT_data_member_location: 36
 <2><be0>: Abbrev Number: 9 (DW_TAG_member)
    <be1>   DW_AT_name        : PSC
    <be5>   DW_AT_decl_file   : 3
    <be5>   DW_AT_decl_line   : 740
    <be7>   DW_AT_decl_column : 17
    <be7>   DW_AT_type        : <0x83e>
    <beb>   DW_AT_data_member_location: 40
 <2><bec>: Abbrev Number: 9 (DW_TAG_member)
    <bed>   DW_AT_name        : ARR
    <bf1>   DW_AT_decl_file   : 3
    <bf1>   DW_AT_decl_line   : 741
    <bf3>   DW_AT_decl_column : 17
    <bf3>   DW_AT_type        : <0x83e>
    <bf7>   DW_AT_data_member_location: 44
 <2><bf8>: Abbrev Number: 9 (DW_TAG_member)
    <bf9>   DW_AT_name        : RCR
    <bfd>   DW_AT_decl_file   : 3
    <bfd>   DW_AT_decl_line   : 742
    <bff>   DW_AT_decl_column : 17
    <bff>   DW_AT_type        : <0x83e>
    <c03>   DW_AT_data_member_location: 48
 <2><c04>: Abbrev Number: 6 (DW_TAG_member)
    <c05>   DW_AT_name        : (indirect string, offset: 0x2359d): CCR1
    <c09>   DW_AT_decl_file   : 3
    <c0a>   DW_AT_decl_line   : 743
    <c0c>   DW_AT_decl_column : 17
    <c0d>   DW_AT_type        : <0x83e>
    <c11>   DW_AT_data_member_location: 52
 <2><c12>: Abbrev Number: 6 (DW_TAG_member)
    <c13>   DW_AT_name        : (indirect string, offset: 0x612d8): CCR2
    <c17>   DW_AT_decl_file   : 3
    <c18>   DW_AT_decl_line   : 744
    <c1a>   DW_AT_decl_column : 17
    <c1b>   DW_AT_type        : <0x83e>
    <c1f>   DW_AT_data_member_location: 56
 <2><c20>: Abbrev Number: 6 (DW_TAG_member)
    <c21>   DW_AT_name        : (indirect string, offset: 0xa6e06): CCR3
    <c25>   DW_AT_decl_file   : 3
    <c26>   DW_AT_decl_line   : 745
    <c28>   DW_AT_decl_column : 17
    <c29>   DW_AT_type        : <0x83e>
    <c2d>   DW_AT_data_member_location: 60
 <2><c2e>: Abbrev Number: 6 (DW_TAG_member)
    <c2f>   DW_AT_name        : (indirect string, offset: 0x176fa): CCR4
    <c33>   DW_AT_decl_file   : 3
    <c34>   DW_AT_decl_line   : 746
    <c36>   DW_AT_decl_column : 17
    <c37>   DW_AT_type        : <0x83e>
    <c3b>   DW_AT_data_member_location: 64
 <2><c3c>: Abbrev Number: 6 (DW_TAG_member)
    <c3d>   DW_AT_name        : (indirect string, offset: 0x96592): BDTR
    <c41>   DW_AT_decl_file   : 3
    <c42>   DW_AT_decl_line   : 747
    <c44>   DW_AT_decl_column : 17
    <c45>   DW_AT_type        : <0x83e>
    <c49>   DW_AT_data_member_location: 68
 <2><c4a>: Abbrev Number: 9 (DW_TAG_member)
    <c4b>   DW_AT_name        : DCR
    <c4f>   DW_AT_decl_file   : 3
    <c4f>   DW_AT_decl_line   : 748
    <c51>   DW_AT_decl_column : 17
    <c51>   DW_AT_type        : <0x83e>
    <c55>   DW_AT_data_member_location: 72
 <2><c56>: Abbrev Number: 6 (DW_TAG_member)
    <c57>   DW_AT_name        : (indirect string, offset: 0xba20b): DMAR
    <c5b>   DW_AT_decl_file   : 3
    <c5c>   DW_AT_decl_line   : 749
    <c5e>   DW_AT_decl_column : 17
    <c5f>   DW_AT_type        : <0x83e>
    <c63>   DW_AT_data_member_location: 76
 <2><c64>: Abbrev Number: 9 (DW_TAG_member)
    <c65>   DW_AT_name        : OR
    <c68>   DW_AT_decl_file   : 3
    <c68>   DW_AT_decl_line   : 750
    <c6a>   DW_AT_decl_column : 17
    <c6a>   DW_AT_type        : <0x83e>
    <c6e>   DW_AT_data_member_location: 80
 <2><c6f>: Abbrev Number: 0
 <1><c70>: Abbrev Number: 18 (DW_TAG_typedef)
    <c71>   DW_AT_name        : (indirect string, offset: 0xcc56a): TIM_TypeDef
    <c75>   DW_AT_decl_file   : 3
    <c76>   DW_AT_decl_line   : 751
    <c78>   DW_AT_decl_column : 3
    <c78>   DW_AT_type        : <0xb56>
 <1><c7c>: Abbrev Number: 30 (DW_TAG_structure_type)
    <c7d>   DW_AT_byte_size   : 28
    <c7e>   DW_AT_decl_file   : 3
    <c7f>   DW_AT_decl_line   : 757
    <c81>   DW_AT_decl_column : 9
    <c81>   DW_AT_sibling     : <0xcda>
 <2><c85>: Abbrev Number: 9 (DW_TAG_member)
    <c86>   DW_AT_name        : SR
    <c89>   DW_AT_decl_file   : 3
    <c89>   DW_AT_decl_line   : 759
    <c8b>   DW_AT_decl_column : 17
    <c8b>   DW_AT_type        : <0x83e>
    <c8f>   DW_AT_data_member_location: 0
 <2><c90>: Abbrev Number: 9 (DW_TAG_member)
    <c91>   DW_AT_name        : DR
    <c94>   DW_AT_decl_file   : 3
    <c94>   DW_AT_decl_line   : 760
    <c96>   DW_AT_decl_column : 17
    <c96>   DW_AT_type        : <0x83e>
    <c9a>   DW_AT_data_member_location: 4
 <2><c9b>: Abbrev Number: 9 (DW_TAG_member)
    <c9c>   DW_AT_name        : BRR
    <ca0>   DW_AT_decl_file   : 3
    <ca0>   DW_AT_decl_line   : 761
    <ca2>   DW_AT_decl_column : 17
    <ca2>   DW_AT_type        : <0x83e>
    <ca6>   DW_AT_data_member_location: 8
 <2><ca7>: Abbrev Number: 9 (DW_TAG_member)
    <ca8>   DW_AT_name        : CR1
    <cac>   DW_AT_decl_file   : 3
    <cac>   DW_AT_decl_line   : 762
    <cae>   DW_AT_decl_column : 17
    <cae>   DW_AT_type        : <0x83e>
    <cb2>   DW_AT_data_member_location: 12
 <2><cb3>: Abbrev Number: 9 (DW_TAG_member)
    <cb4>   DW_AT_name        : CR2
    <cb8>   DW_AT_decl_file   : 3
    <cb8>   DW_AT_decl_line   : 763
    <cba>   DW_AT_decl_column : 17
    <cba>   DW_AT_type        : <0x83e>
    <cbe>   DW_AT_data_member_location: 16
 <2><cbf>: Abbrev Number: 9 (DW_TAG_member)
    <cc0>   DW_AT_name        : CR3
    <cc4>   DW_AT_decl_file   : 3
    <cc4>   DW_AT_decl_line   : 764
    <cc6>   DW_AT_decl_column : 17
    <cc6>   DW_AT_type        : <0x83e>
    <cca>   DW_AT_data_member_location: 20
 <2><ccb>: Abbrev Number: 6 (DW_TAG_member)
    <ccc>   DW_AT_name        : (indirect string, offset: 0x43be7): GTPR
    <cd0>   DW_AT_decl_file   : 3
    <cd1>   DW_AT_decl_line   : 765
    <cd3>   DW_AT_decl_column : 17
    <cd4>   DW_AT_type        : <0x83e>
    <cd8>   DW_AT_data_member_location: 24
 <2><cd9>: Abbrev Number: 0
 <1><cda>: Abbrev Number: 18 (DW_TAG_typedef)
    <cdb>   DW_AT_name        : (indirect string, offset: 0xd559c): USART_TypeDef
    <cdf>   DW_AT_decl_file   : 3
    <ce0>   DW_AT_decl_line   : 766
    <ce2>   DW_AT_decl_column : 3
    <ce2>   DW_AT_type        : <0xc7c>
 <1><ce6>: Abbrev Number: 4 (DW_TAG_typedef)
    <ce7>   DW_AT_name        : (indirect string, offset: 0xd2f): size_t
    <ceb>   DW_AT_decl_file   : 6
    <cec>   DW_AT_decl_line   : 214
    <ced>   DW_AT_decl_column : 23
    <cee>   DW_AT_type        : <0x7f1>
 <1><cf2>: Abbrev Number: 10 (DW_TAG_const_type)
    <cf3>   DW_AT_type        : <0xce6>
 <1><cf7>: Abbrev Number: 17 (DW_TAG_base_type)
    <cf8>   DW_AT_byte_size   : 8
    <cf9>   DW_AT_encoding    : 4	(float)
    <cfa>   DW_AT_name        : (indirect string, offset: 0x37b): long double
 <1><cfe>: Abbrev Number: 22 (DW_TAG_enumeration_type)
    <cff>   DW_AT_encoding    : 7	(unsigned)
    <d00>   DW_AT_byte_size   : 1
    <d01>   DW_AT_type        : <0x77d>
    <d05>   DW_AT_decl_file   : 7
    <d06>   DW_AT_decl_line   : 39
    <d07>   DW_AT_decl_column : 1
    <d08>   DW_AT_sibling     : <0xd25>
 <2><d0c>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d0d>   DW_AT_name        : (indirect string, offset: 0x4fb9c): HAL_OK
    <d11>   DW_AT_const_value : 0
 <2><d12>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d13>   DW_AT_name        : (indirect string, offset: 0x8ae0b): HAL_ERROR
    <d17>   DW_AT_const_value : 1
 <2><d18>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d19>   DW_AT_name        : (indirect string, offset: 0x2f005): HAL_BUSY
    <d1d>   DW_AT_const_value : 2
 <2><d1e>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d1f>   DW_AT_name        : (indirect string, offset: 0x46c30): HAL_TIMEOUT
    <d23>   DW_AT_const_value : 3
 <2><d24>: Abbrev Number: 0
 <1><d25>: Abbrev Number: 4 (DW_TAG_typedef)
    <d26>   DW_AT_name        : (indirect string, offset: 0xd50e): HAL_StatusTypeDef
    <d2a>   DW_AT_decl_file   : 7
    <d2b>   DW_AT_decl_line   : 44
    <d2c>   DW_AT_decl_column : 3
    <d2d>   DW_AT_type        : <0xcfe>
 <1><d31>: Abbrev Number: 22 (DW_TAG_enumeration_type)
    <d32>   DW_AT_encoding    : 7	(unsigned)
    <d33>   DW_AT_byte_size   : 1
    <d34>   DW_AT_type        : <0x77d>
    <d38>   DW_AT_decl_file   : 7
    <d39>   DW_AT_decl_line   : 50
    <d3a>   DW_AT_decl_column : 1
    <d3b>   DW_AT_sibling     : <0xd4c>
 <2><d3f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d40>   DW_AT_name        : (indirect string, offset: 0xa1fe0): HAL_UNLOCKED
    <d44>   DW_AT_const_value : 0
 <2><d45>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d46>   DW_AT_name        : (indirect string, offset: 0xd6dc0): HAL_LOCKED
    <d4a>   DW_AT_const_value : 1
 <2><d4b>: Abbrev Number: 0
 <1><d4c>: Abbrev Number: 4 (DW_TAG_typedef)
    <d4d>   DW_AT_name        : (indirect string, offset: 0x83ce6): HAL_LockTypeDef
    <d51>   DW_AT_decl_file   : 7
    <d52>   DW_AT_decl_line   : 53
    <d53>   DW_AT_decl_column : 3
    <d54>   DW_AT_type        : <0xd31>
 <1><d58>: Abbrev Number: 13 (DW_TAG_structure_type)
    <d59>   DW_AT_byte_size   : 24
    <d5a>   DW_AT_decl_file   : 8
    <d5b>   DW_AT_decl_line   : 45
    <d5c>   DW_AT_decl_column : 9
    <d5d>   DW_AT_sibling     : <0xdb0>
 <2><d61>: Abbrev Number: 1 (DW_TAG_member)
    <d62>   DW_AT_name        : (indirect string, offset: 0x93f8a): PLLState
    <d66>   DW_AT_decl_file   : 8
    <d67>   DW_AT_decl_line   : 47
    <d68>   DW_AT_decl_column : 12
    <d69>   DW_AT_type        : <0x832>
    <d6d>   DW_AT_data_member_location: 0
 <2><d6e>: Abbrev Number: 1 (DW_TAG_member)
    <d6f>   DW_AT_name        : (indirect string, offset: 0x98ad9): PLLSource
    <d73>   DW_AT_decl_file   : 8
    <d74>   DW_AT_decl_line   : 50
    <d75>   DW_AT_decl_column : 12
    <d76>   DW_AT_type        : <0x832>
    <d7a>   DW_AT_data_member_location: 4
 <2><d7b>: Abbrev Number: 1 (DW_TAG_member)
    <d7c>   DW_AT_name        : (indirect string, offset: 0xb3ef0): PLLM
    <d80>   DW_AT_decl_file   : 8
    <d81>   DW_AT_decl_line   : 53
    <d82>   DW_AT_decl_column : 12
    <d83>   DW_AT_type        : <0x832>
    <d87>   DW_AT_data_member_location: 8
 <2><d88>: Abbrev Number: 1 (DW_TAG_member)
    <d89>   DW_AT_name        : (indirect string, offset: 0xb3ef5): PLLN
    <d8d>   DW_AT_decl_file   : 8
    <d8e>   DW_AT_decl_line   : 56
    <d8f>   DW_AT_decl_column : 12
    <d90>   DW_AT_type        : <0x832>
    <d94>   DW_AT_data_member_location: 12
 <2><d95>: Abbrev Number: 1 (DW_TAG_member)
    <d96>   DW_AT_name        : (indirect string, offset: 0xb3f12): PLLP
    <d9a>   DW_AT_decl_file   : 8
    <d9b>   DW_AT_decl_line   : 60
    <d9c>   DW_AT_decl_column : 12
    <d9d>   DW_AT_type        : <0x832>
    <da1>   DW_AT_data_member_location: 16
 <2><da2>: Abbrev Number: 1 (DW_TAG_member)
    <da3>   DW_AT_name        : (indirect string, offset: 0x56c93): PLLQ
    <da7>   DW_AT_decl_file   : 8
    <da8>   DW_AT_decl_line   : 63
    <da9>   DW_AT_decl_column : 12
    <daa>   DW_AT_type        : <0x832>
    <dae>   DW_AT_data_member_location: 20
 <2><daf>: Abbrev Number: 0
 <1><db0>: Abbrev Number: 4 (DW_TAG_typedef)
    <db1>   DW_AT_name        : (indirect string, offset: 0x86b96): RCC_PLLInitTypeDef
    <db5>   DW_AT_decl_file   : 8
    <db6>   DW_AT_decl_line   : 73
    <db7>   DW_AT_decl_column : 3
    <db8>   DW_AT_type        : <0xd58>
 <1><dbc>: Abbrev Number: 13 (DW_TAG_structure_type)
    <dbd>   DW_AT_byte_size   : 48
    <dbe>   DW_AT_decl_file   : 9
    <dbf>   DW_AT_decl_line   : 49
    <dc0>   DW_AT_decl_column : 9
    <dc1>   DW_AT_sibling     : <0xe21>
 <2><dc5>: Abbrev Number: 1 (DW_TAG_member)
    <dc6>   DW_AT_name        : (indirect string, offset: 0x16b7c): OscillatorType
    <dca>   DW_AT_decl_file   : 9
    <dcb>   DW_AT_decl_line   : 51
    <dcc>   DW_AT_decl_column : 12
    <dcd>   DW_AT_type        : <0x832>
    <dd1>   DW_AT_data_member_location: 0
 <2><dd2>: Abbrev Number: 1 (DW_TAG_member)
    <dd3>   DW_AT_name        : (indirect string, offset: 0x95945): HSEState
    <dd7>   DW_AT_decl_file   : 9
    <dd8>   DW_AT_decl_line   : 54
    <dd9>   DW_AT_decl_column : 12
    <dda>   DW_AT_type        : <0x832>
    <dde>   DW_AT_data_member_location: 4
 <2><ddf>: Abbrev Number: 1 (DW_TAG_member)
    <de0>   DW_AT_name        : (indirect string, offset: 0x8b79a): LSEState
    <de4>   DW_AT_decl_file   : 9
    <de5>   DW_AT_decl_line   : 57
    <de6>   DW_AT_decl_column : 12
    <de7>   DW_AT_type        : <0x832>
    <deb>   DW_AT_data_member_location: 8
 <2><dec>: Abbrev Number: 1 (DW_TAG_member)
    <ded>   DW_AT_name        : (indirect string, offset: 0x66200): HSIState
    <df1>   DW_AT_decl_file   : 9
    <df2>   DW_AT_decl_line   : 60
    <df3>   DW_AT_decl_column : 12
    <df4>   DW_AT_type        : <0x832>
    <df8>   DW_AT_data_member_location: 12
 <2><df9>: Abbrev Number: 1 (DW_TAG_member)
    <dfa>   DW_AT_name        : (indirect string, offset: 0xba45f): HSICalibrationValue
    <dfe>   DW_AT_decl_file   : 9
    <dff>   DW_AT_decl_line   : 63
    <e00>   DW_AT_decl_column : 12
    <e01>   DW_AT_type        : <0x832>
    <e05>   DW_AT_data_member_location: 16
 <2><e06>: Abbrev Number: 1 (DW_TAG_member)
    <e07>   DW_AT_name        : (indirect string, offset: 0x525f9): LSIState
    <e0b>   DW_AT_decl_file   : 9
    <e0c>   DW_AT_decl_line   : 66
    <e0d>   DW_AT_decl_column : 12
    <e0e>   DW_AT_type        : <0x832>
    <e12>   DW_AT_data_member_location: 20
 <2><e13>: Abbrev Number: 19 (DW_TAG_member)
    <e14>   DW_AT_name        : PLL
    <e18>   DW_AT_decl_file   : 9
    <e19>   DW_AT_decl_line   : 69
    <e1a>   DW_AT_decl_column : 22
    <e1b>   DW_AT_type        : <0xdb0>
    <e1f>   DW_AT_data_member_location: 24
 <2><e20>: Abbrev Number: 0
 <1><e21>: Abbrev Number: 4 (DW_TAG_typedef)
    <e22>   DW_AT_name        : (indirect string, offset: 0x779fe): RCC_OscInitTypeDef
    <e26>   DW_AT_decl_file   : 9
    <e27>   DW_AT_decl_line   : 70
    <e28>   DW_AT_decl_column : 3
    <e29>   DW_AT_type        : <0xdbc>
 <1><e2d>: Abbrev Number: 10 (DW_TAG_const_type)
    <e2e>   DW_AT_type        : <0xe21>
 <1><e32>: Abbrev Number: 13 (DW_TAG_structure_type)
    <e33>   DW_AT_byte_size   : 20
    <e34>   DW_AT_decl_file   : 9
    <e35>   DW_AT_decl_line   : 75
    <e36>   DW_AT_decl_column : 9
    <e37>   DW_AT_sibling     : <0xe7d>
 <2><e3b>: Abbrev Number: 1 (DW_TAG_member)
    <e3c>   DW_AT_name        : (indirect string, offset: 0x49686): ClockType
    <e40>   DW_AT_decl_file   : 9
    <e41>   DW_AT_decl_line   : 77
    <e42>   DW_AT_decl_column : 12
    <e43>   DW_AT_type        : <0x832>
    <e47>   DW_AT_data_member_location: 0
 <2><e48>: Abbrev Number: 1 (DW_TAG_member)
    <e49>   DW_AT_name        : (indirect string, offset: 0x8664e): SYSCLKSource
    <e4d>   DW_AT_decl_file   : 9
    <e4e>   DW_AT_decl_line   : 80
    <e4f>   DW_AT_decl_column : 12
    <e50>   DW_AT_type        : <0x832>
    <e54>   DW_AT_data_member_location: 4
 <2><e55>: Abbrev Number: 1 (DW_TAG_member)
    <e56>   DW_AT_name        : (indirect string, offset: 0xb38e9): AHBCLKDivider
    <e5a>   DW_AT_decl_file   : 9
    <e5b>   DW_AT_decl_line   : 83
    <e5c>   DW_AT_decl_column : 12
    <e5d>   DW_AT_type        : <0x832>
    <e61>   DW_AT_data_member_location: 8
 <2><e62>: Abbrev Number: 1 (DW_TAG_member)
    <e63>   DW_AT_name        : (indirect string, offset: 0x12a4d): APB1CLKDivider
    <e67>   DW_AT_decl_file   : 9
    <e68>   DW_AT_decl_line   : 86
    <e69>   DW_AT_decl_column : 12
    <e6a>   DW_AT_type        : <0x832>
    <e6e>   DW_AT_data_member_location: 12
 <2><e6f>: Abbrev Number: 1 (DW_TAG_member)
    <e70>   DW_AT_name        : (indirect string, offset: 0x68b09): APB2CLKDivider
    <e74>   DW_AT_decl_file   : 9
    <e75>   DW_AT_decl_line   : 89
    <e76>   DW_AT_decl_column : 12
    <e77>   DW_AT_type        : <0x832>
    <e7b>   DW_AT_data_member_location: 16
 <2><e7c>: Abbrev Number: 0
 <1><e7d>: Abbrev Number: 4 (DW_TAG_typedef)
    <e7e>   DW_AT_name        : (indirect string, offset: 0x99d59): RCC_ClkInitTypeDef
    <e82>   DW_AT_decl_file   : 9
    <e83>   DW_AT_decl_line   : 92
    <e84>   DW_AT_decl_column : 3
    <e85>   DW_AT_type        : <0xe32>
 <1><e89>: Abbrev Number: 10 (DW_TAG_const_type)
    <e8a>   DW_AT_type        : <0xe7d>
 <1><e8e>: Abbrev Number: 13 (DW_TAG_structure_type)
    <e8f>   DW_AT_byte_size   : 20
    <e90>   DW_AT_decl_file   : 10
    <e91>   DW_AT_decl_line   : 46
    <e92>   DW_AT_decl_column : 9
    <e93>   DW_AT_sibling     : <0xed9>
 <2><e97>: Abbrev Number: 19 (DW_TAG_member)
    <e98>   DW_AT_name        : Pin
    <e9c>   DW_AT_decl_file   : 10
    <e9d>   DW_AT_decl_line   : 48
    <e9e>   DW_AT_decl_column : 12
    <e9f>   DW_AT_type        : <0x832>
    <ea3>   DW_AT_data_member_location: 0
 <2><ea4>: Abbrev Number: 1 (DW_TAG_member)
    <ea5>   DW_AT_name        : (indirect string, offset: 0x63ce4): Mode
    <ea9>   DW_AT_decl_file   : 10
    <eaa>   DW_AT_decl_line   : 51
    <eab>   DW_AT_decl_column : 12
    <eac>   DW_AT_type        : <0x832>
    <eb0>   DW_AT_data_member_location: 4
 <2><eb1>: Abbrev Number: 1 (DW_TAG_member)
    <eb2>   DW_AT_name        : (indirect string, offset: 0x7435c): Pull
    <eb6>   DW_AT_decl_file   : 10
    <eb7>   DW_AT_decl_line   : 54
    <eb8>   DW_AT_decl_column : 12
    <eb9>   DW_AT_type        : <0x832>
    <ebd>   DW_AT_data_member_location: 8
 <2><ebe>: Abbrev Number: 1 (DW_TAG_member)
    <ebf>   DW_AT_name        : (indirect string, offset: 0xdcb15): Speed
    <ec3>   DW_AT_decl_file   : 10
    <ec4>   DW_AT_decl_line   : 57
    <ec5>   DW_AT_decl_column : 12
    <ec6>   DW_AT_type        : <0x832>
    <eca>   DW_AT_data_member_location: 12
 <2><ecb>: Abbrev Number: 1 (DW_TAG_member)
    <ecc>   DW_AT_name        : (indirect string, offset: 0x68aca): Alternate
    <ed0>   DW_AT_decl_file   : 10
    <ed1>   DW_AT_decl_line   : 60
    <ed2>   DW_AT_decl_column : 12
    <ed3>   DW_AT_type        : <0x832>
    <ed7>   DW_AT_data_member_location: 16
 <2><ed8>: Abbrev Number: 0
 <1><ed9>: Abbrev Number: 4 (DW_TAG_typedef)
    <eda>   DW_AT_name        : (indirect string, offset: 0xaaa4b): GPIO_InitTypeDef
    <ede>   DW_AT_decl_file   : 10
    <edf>   DW_AT_decl_line   : 62
    <ee0>   DW_AT_decl_column : 2
    <ee1>   DW_AT_type        : <0xe8e>
 <1><ee5>: Abbrev Number: 22 (DW_TAG_enumeration_type)
    <ee6>   DW_AT_encoding    : 7	(unsigned)
    <ee7>   DW_AT_byte_size   : 1
    <ee8>   DW_AT_type        : <0x77d>
    <eec>   DW_AT_decl_file   : 10
    <eed>   DW_AT_decl_line   : 68
    <eee>   DW_AT_decl_column : 1
    <eef>   DW_AT_sibling     : <0xf00>
 <2><ef3>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ef4>   DW_AT_name        : (indirect string, offset: 0x35904): GPIO_PIN_RESET
    <ef8>   DW_AT_const_value : 0
 <2><ef9>: Abbrev Number: 2 (DW_TAG_enumerator)
    <efa>   DW_AT_name        : (indirect string, offset: 0x3eac6): GPIO_PIN_SET
    <efe>   DW_AT_const_value : 1
 <2><eff>: Abbrev Number: 0
 <1><f00>: Abbrev Number: 4 (DW_TAG_typedef)
    <f01>   DW_AT_name        : (indirect string, offset: 0xd3901): GPIO_PinState
    <f05>   DW_AT_decl_file   : 10
    <f06>   DW_AT_decl_line   : 71
    <f07>   DW_AT_decl_column : 2
    <f08>   DW_AT_type        : <0xee5>
 <1><f0c>: Abbrev Number: 13 (DW_TAG_structure_type)
    <f0d>   DW_AT_byte_size   : 48
    <f0e>   DW_AT_decl_file   : 11
    <f0f>   DW_AT_decl_line   : 48
    <f10>   DW_AT_decl_column : 9
    <f11>   DW_AT_sibling     : <0xfb2>
 <2><f15>: Abbrev Number: 1 (DW_TAG_member)
    <f16>   DW_AT_name        : (indirect string, offset: 0x75279): Channel
    <f1a>   DW_AT_decl_file   : 11
    <f1b>   DW_AT_decl_line   : 50
    <f1c>   DW_AT_decl_column : 12
    <f1d>   DW_AT_type        : <0x832>
    <f21>   DW_AT_data_member_location: 0
 <2><f22>: Abbrev Number: 1 (DW_TAG_member)
    <f23>   DW_AT_name        : (indirect string, offset: 0x56880): Direction
    <f27>   DW_AT_decl_file   : 11
    <f28>   DW_AT_decl_line   : 53
    <f29>   DW_AT_decl_column : 12
    <f2a>   DW_AT_type        : <0x832>
    <f2e>   DW_AT_data_member_location: 4
 <2><f2f>: Abbrev Number: 1 (DW_TAG_member)
    <f30>   DW_AT_name        : (indirect string, offset: 0x181fc): PeriphInc
    <f34>   DW_AT_decl_file   : 11
    <f35>   DW_AT_decl_line   : 57
    <f36>   DW_AT_decl_column : 12
    <f37>   DW_AT_type        : <0x832>
    <f3b>   DW_AT_data_member_location: 8
 <2><f3c>: Abbrev Number: 1 (DW_TAG_member)
    <f3d>   DW_AT_name        : (indirect string, offset: 0x2b118): MemInc
    <f41>   DW_AT_decl_file   : 11
    <f42>   DW_AT_decl_line   : 60
    <f43>   DW_AT_decl_column : 12
    <f44>   DW_AT_type        : <0x832>
    <f48>   DW_AT_data_member_location: 12
 <2><f49>: Abbrev Number: 1 (DW_TAG_member)
    <f4a>   DW_AT_name        : (indirect string, offset: 0x708ca): PeriphDataAlignment
    <f4e>   DW_AT_decl_file   : 11
    <f4f>   DW_AT_decl_line   : 63
    <f50>   DW_AT_decl_column : 12
    <f51>   DW_AT_type        : <0x832>
    <f55>   DW_AT_data_member_location: 16
 <2><f56>: Abbrev Number: 1 (DW_TAG_member)
    <f57>   DW_AT_name        : (indirect string, offset: 0xc3b0f): MemDataAlignment
    <f5b>   DW_AT_decl_file   : 11
    <f5c>   DW_AT_decl_line   : 66
    <f5d>   DW_AT_decl_column : 12
    <f5e>   DW_AT_type        : <0x832>
    <f62>   DW_AT_data_member_location: 20
 <2><f63>: Abbrev Number: 1 (DW_TAG_member)
    <f64>   DW_AT_name        : (indirect string, offset: 0x63ce4): Mode
    <f68>   DW_AT_decl_file   : 11
    <f69>   DW_AT_decl_line   : 69
    <f6a>   DW_AT_decl_column : 12
    <f6b>   DW_AT_type        : <0x832>
    <f6f>   DW_AT_data_member_location: 24
 <2><f70>: Abbrev Number: 1 (DW_TAG_member)
    <f71>   DW_AT_name        : (indirect string, offset: 0xdc3b2): Priority
    <f75>   DW_AT_decl_file   : 11
    <f76>   DW_AT_decl_line   : 74
    <f77>   DW_AT_decl_column : 12
    <f78>   DW_AT_type        : <0x832>
    <f7c>   DW_AT_data_member_location: 28
 <2><f7d>: Abbrev Number: 1 (DW_TAG_member)
    <f7e>   DW_AT_name        : (indirect string, offset: 0x62fd2): FIFOMode
    <f82>   DW_AT_decl_file   : 11
    <f83>   DW_AT_decl_line   : 77
    <f84>   DW_AT_decl_column : 12
    <f85>   DW_AT_type        : <0x832>
    <f89>   DW_AT_data_member_location: 32
 <2><f8a>: Abbrev Number: 1 (DW_TAG_member)
    <f8b>   DW_AT_name        : (indirect string, offset: 0xa6327): FIFOThreshold
    <f8f>   DW_AT_decl_file   : 11
    <f90>   DW_AT_decl_line   : 82
    <f91>   DW_AT_decl_column : 12
    <f92>   DW_AT_type        : <0x832>
    <f96>   DW_AT_data_member_location: 36
 <2><f97>: Abbrev Number: 1 (DW_TAG_member)
    <f98>   DW_AT_name        : (indirect string, offset: 0xa45f0): MemBurst
    <f9c>   DW_AT_decl_file   : 11
    <f9d>   DW_AT_decl_line   : 85
    <f9e>   DW_AT_decl_column : 12
    <f9f>   DW_AT_type        : <0x832>
    <fa3>   DW_AT_data_member_location: 40
 <2><fa4>: Abbrev Number: 1 (DW_TAG_member)
    <fa5>   DW_AT_name        : (indirect string, offset: 0x50bd9): PeriphBurst
    <fa9>   DW_AT_decl_file   : 11
    <faa>   DW_AT_decl_line   : 91
    <fab>   DW_AT_decl_column : 12
    <fac>   DW_AT_type        : <0x832>
    <fb0>   DW_AT_data_member_location: 44
 <2><fb1>: Abbrev Number: 0
 <1><fb2>: Abbrev Number: 4 (DW_TAG_typedef)
    <fb3>   DW_AT_name        : (indirect string, offset: 0x41e64): DMA_InitTypeDef
    <fb7>   DW_AT_decl_file   : 11
    <fb8>   DW_AT_decl_line   : 96
    <fb9>   DW_AT_decl_column : 2
    <fba>   DW_AT_type        : <0xf0c>
 <1><fbe>: Abbrev Number: 22 (DW_TAG_enumeration_type)
    <fbf>   DW_AT_encoding    : 7	(unsigned)
    <fc0>   DW_AT_byte_size   : 1
    <fc1>   DW_AT_type        : <0x77d>
    <fc5>   DW_AT_decl_file   : 11
    <fc6>   DW_AT_decl_line   : 103
    <fc7>   DW_AT_decl_column : 1
    <fc8>   DW_AT_sibling     : <0xff1>
 <2><fcc>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fcd>   DW_AT_name        : (indirect string, offset: 0x17d58): HAL_DMA_STATE_RESET
    <fd1>   DW_AT_const_value : 0
 <2><fd2>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fd3>   DW_AT_name        : (indirect string, offset: 0x432d3): HAL_DMA_STATE_READY
    <fd7>   DW_AT_const_value : 1
 <2><fd8>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fd9>   DW_AT_name        : (indirect string, offset: 0x98378): HAL_DMA_STATE_BUSY
    <fdd>   DW_AT_const_value : 2
 <2><fde>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fdf>   DW_AT_name        : (indirect string, offset: 0xd3cb8): HAL_DMA_STATE_TIMEOUT
    <fe3>   DW_AT_const_value : 3
 <2><fe4>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fe5>   DW_AT_name        : (indirect string, offset: 0xb9717): HAL_DMA_STATE_ERROR
    <fe9>   DW_AT_const_value : 4
 <2><fea>: Abbrev Number: 2 (DW_TAG_enumerator)
    <feb>   DW_AT_name        : (indirect string, offset: 0x5ab28): HAL_DMA_STATE_ABORT
    <fef>   DW_AT_const_value : 5
 <2><ff0>: Abbrev Number: 0
 <1><ff1>: Abbrev Number: 4 (DW_TAG_typedef)
    <ff2>   DW_AT_name        : (indirect string, offset: 0xc2c2f): HAL_DMA_StateTypeDef
    <ff6>   DW_AT_decl_file   : 11
    <ff7>   DW_AT_decl_line   : 110
    <ff8>   DW_AT_decl_column : 2
    <ff9>   DW_AT_type        : <0xfbe>
 <1><ffd>: Abbrev Number: 23 (DW_TAG_volatile_type)
    <ffe>   DW_AT_type        : <0xff1>
 <1><1002>: Abbrev Number: 7 (DW_TAG_structure_type)
    <1003>   DW_AT_name        : (indirect string, offset: 0xb86b4): __DMA_HandleTypeDef
    <1007>   DW_AT_byte_size   : 96
    <1008>   DW_AT_decl_file   : 11
    <1009>   DW_AT_decl_line   : 138
    <100a>   DW_AT_decl_column : 16
    <100b>   DW_AT_sibling     : <0x10c6>
 <2><100f>: Abbrev Number: 1 (DW_TAG_member)
    <1010>   DW_AT_name        : (indirect string, offset: 0xd07fa): Instance
    <1014>   DW_AT_decl_file   : 11
    <1015>   DW_AT_decl_line   : 140
    <1016>   DW_AT_decl_column : 31
    <1017>   DW_AT_type        : <0x10c6>
    <101b>   DW_AT_data_member_location: 0
 <2><101c>: Abbrev Number: 1 (DW_TAG_member)
    <101d>   DW_AT_name        : (indirect string, offset: 0x6d7ad): Init
    <1021>   DW_AT_decl_file   : 11
    <1022>   DW_AT_decl_line   : 142
    <1023>   DW_AT_decl_column : 30
    <1024>   DW_AT_type        : <0xfb2>
    <1028>   DW_AT_data_member_location: 4
 <2><1029>: Abbrev Number: 1 (DW_TAG_member)
    <102a>   DW_AT_name        : (indirect string, offset: 0x9c70e): Lock
    <102e>   DW_AT_decl_file   : 11
    <102f>   DW_AT_decl_line   : 144
    <1030>   DW_AT_decl_column : 30
    <1031>   DW_AT_type        : <0xd4c>
    <1035>   DW_AT_data_member_location: 52
 <2><1036>: Abbrev Number: 1 (DW_TAG_member)
    <1037>   DW_AT_name        : (indirect string, offset: 0xdce26): State
    <103b>   DW_AT_decl_file   : 11
    <103c>   DW_AT_decl_line   : 146
    <103d>   DW_AT_decl_column : 30
    <103e>   DW_AT_type        : <0xffd>
    <1042>   DW_AT_data_member_location: 53
 <2><1043>: Abbrev Number: 1 (DW_TAG_member)
    <1044>   DW_AT_name        : (indirect string, offset: 0xcd40c): Parent
    <1048>   DW_AT_decl_file   : 11
    <1049>   DW_AT_decl_line   : 148
    <104a>   DW_AT_decl_column : 31
    <104b>   DW_AT_type        : <0x10cb>
    <104f>   DW_AT_data_member_location: 56
 <2><1050>: Abbrev Number: 1 (DW_TAG_member)
    <1051>   DW_AT_name        : (indirect string, offset: 0xd6335): XferCpltCallback
    <1055>   DW_AT_decl_file   : 11
    <1056>   DW_AT_decl_line   : 150
    <1057>   DW_AT_decl_column : 33
    <1058>   DW_AT_type        : <0x10dd>
    <105c>   DW_AT_data_member_location: 60
 <2><105d>: Abbrev Number: 1 (DW_TAG_member)
    <105e>   DW_AT_name        : (indirect string, offset: 0xa9977): XferHalfCpltCallback
    <1062>   DW_AT_decl_file   : 11
    <1063>   DW_AT_decl_line   : 152
    <1064>   DW_AT_decl_column : 33
    <1065>   DW_AT_type        : <0x10dd>
    <1069>   DW_AT_data_member_location: 64
 <2><106a>: Abbrev Number: 1 (DW_TAG_member)
    <106b>   DW_AT_name        : (indirect string, offset: 0x83300): XferM1CpltCallback
    <106f>   DW_AT_decl_file   : 11
    <1070>   DW_AT_decl_line   : 154
    <1071>   DW_AT_decl_column : 33
    <1072>   DW_AT_type        : <0x10dd>
    <1076>   DW_AT_data_member_location: 68
 <2><1077>: Abbrev Number: 1 (DW_TAG_member)
    <1078>   DW_AT_name        : (indirect string, offset: 0x6d4e4): XferM1HalfCpltCallback
    <107c>   DW_AT_decl_file   : 11
    <107d>   DW_AT_decl_line   : 156
    <107e>   DW_AT_decl_column : 33
    <107f>   DW_AT_type        : <0x10dd>
    <1083>   DW_AT_data_member_location: 72
 <2><1084>: Abbrev Number: 1 (DW_TAG_member)
    <1085>   DW_AT_name        : (indirect string, offset: 0x28703): XferErrorCallback
    <1089>   DW_AT_decl_file   : 11
    <108a>   DW_AT_decl_line   : 158
    <108b>   DW_AT_decl_column : 33
    <108c>   DW_AT_type        : <0x10dd>
    <1090>   DW_AT_data_member_location: 76
 <2><1091>: Abbrev Number: 1 (DW_TAG_member)
